[
	{
		"sentence": "The effective use of Information and Communication Technology (ICT) to enable interoperability in public procurement is an area of great significance for achieving the Lisbon objectives, i.e. to become the most competitive and dynamic knowledge-based economy in the world (EC 2005)."
	},	{
		"sentence": "However, the current European public eProcurement infrastructure is inappropriate because it is characterized by a high market fragmentation and a lack of interoperability.",
		"causality": {
			"cause": "it is characterized by a high market fragmentation and a lack of interoperability",
			"effect": "the current European public eProcurement infrastructure is inappropriate"
		}
	},	{
		"sentence": "Hence, a major objective of the European Commission is to enable European-wide eProcurement across borders by creating common principles and technical solutions that are applied within all Member States."
	},	{
		"sentence": "eProcurement requires efforts to be done by public administrations, in particular to exploit new technologies for interoperability that enable easy information accessibility, improving the availability of pan-European services and interaction among citizens and businesses (European_Dynamics_S_A 2004)."
	},	{
		"sentence": "Governments are the largest buyer in the European Union which purchase at a level of approximately 15-20% of GDP (Ministerial_Declaration 2005)."
	},	{
		"sentence": "Governments are lagging behind major industries in exchanging relevant data with key actors such as suppliers."
	},	{
		"sentence": "Common standards for electronic data exchange seem to be a key element for companies to participate in public eProcurement."
	},	{
		"sentence": "A Europeanwide eProcurement infrastructure could save governments up to 5% on expenditure and the transaction costs for both buyers and suppliers could be reduced by 50-80%."
	},	{
		"sentence": "A greater competition and efficiency in eProcurement will influence the whole economy and may also play an important role in achieving the Lisbon objectives, e.g. to become the most competitive and dynamic knowledgebased economy in the world (Commission_of_the_European_Communitites 2004)."
	},	{
		"sentence": "The Manchester ministerial declaration of 24 November 2005 defines the target that ((Ministerial_Declaration 2005) p. 4): By 2010 all public administrations across Europe will have the capability of carrying out 100% of their procurement electronically, where legally permissible, thus creating a fairer and more transparent market for all companies independent of a company's size or location within the single market."
	},	{
		"sentence": "By 2010 at least 50% of public procurement above the EU public procurement threshold will be carried out electronically."
	},	{
		"sentence": "Over the period 2006-2010 Member States will focus their efforts on delivering those high impact services in Europe which will contribute most to the achievement of the Lisbon Agenda."
	},	{
		"sentence": "It is expected that an interoperable eProcurement infrastructure ensures equal treatment and nondiscrimination and that it facilitates fairer and more effective competition in the European market by enabling suppliers to compete in an open and transparent way."
	},	{
		"sentence": "However, current eProcurement infrastructures are inappropriate to reach this ambitious aim since these are characterized by a high market fragmentation.",
		"causality": {
			"cause": "these are characterized by a high market fragmentation",
			"effect": "current eProcurement infrastructures are inappropriate to reach this ambitious aim"
		}
	},	{
		"sentence": "A lack of interoperability - different, non-operable and incompatible technical solutions - hinders suppliers in accessing eProcurement systems and discourages their participation cause of additional difficulties or increased costs.",
		"causality": {
			"cause": "additional difficulties or increased costs",
			"effect": "A lack of interoperability - different, non-operable and incompatible technical solutions - hinders suppliers in accessing eProcurement systems and discourages their participation"
		}
	},	{
		"sentence": "Across Europe, eProcurement systems have already been developed with a focus on the automation of different eProcurement procedures."
	},	{
		"sentence": "Current systems reflect various country-specific public procurement needs and national laws, priorities, and practices."
	},	{
		"sentence": "Systems are either centrally oriented or designed to reflect federated systems demands."
	},	{
		"sentence": "In addition, varying terminologies are used within the European Member States."
	},	{
		"sentence": "The lack of a unified eProcurement terminology is a major barrier which affects the possibility of a smooth collaboration between Member States and their eProcurement systems (Commission_of_the_European_Communitites 2004)."
	},	{
		"sentence": "Legal, technical and organisational barriers prevent the development of a common Procurement infrastructure and are one of the greatest challenges to be solved by politics, governments, ICT industry and research (European_Dynamics_S_A 2004)."
	},	{
		"sentence": "To facilitate EU-wide interoperability in public eProcurement, the European Commission co-funds the PEPPOL project in the ICT Policy Support Programme within the Competiveness and Innovation framework Programme (CIP)."
	},	{
		"sentence": "PEPPOL2 aims at setting up pan-European pilot solutions that conjointly exist with national infrastructures."
	},	{
		"sentence": "Among the building blocks the PEPPOL consortium develops, the Virtual Company Dossier (VCD) focuses on an interoperable solution which contains the documents required from economic operators to evidence their qualification as well as qualitative selection or exclusion according to the directive 2004/18/EC."
	},	{
		"sentence": "The pre-VCD mapping tool introduces a procedure to collect information about the evidences for specific Call for Tenders."
	},	{
		"sentence": "Thereby the Status quo procedure of section 1.2 remains unchanged, except that a pre-VCD mapping exists which is implemented and provided through a European service provider9 (see Figure 5)."
	},	{
		"sentence": "The mapping tool provides information to the economic operator on which national attestations of his or her country fulfill the criteria set by the procuring agency in the respective country (steps 4, 5)."
	},	{
		"sentence": "Likewise, the contracting authority can check evidences and authorizations provided by economic operators via the pre-VCD mapping tool (step 9)."
	},	{
		"sentence": "To fulfill a first precondition for a VCD package as introduced in Stages 2 and beyond, the pre-VCD mapping tool is the proposed function and the process that allows for its execution."
	},	{
		"sentence": "It consists of a tool and of a data structure representing different contexts."
	},	{
		"sentence": "These contexts are linked to the national public procurement domains and a single European common domain."
	},	{
		"sentence": "For every domain we suppose to get a representation of a national index which provides an overview of national criteria demanded in public procurement, and how these are evidenced (i.e. which attestations and/or statements provide what evidence)."
	},	{
		"sentence": "This index also indicates structural data of evidence for example the issuer of the individual attestations or statements and the service it may activate for public or reserved access."
	},	{
		"sentence": "In this respect, the European selection and exclusion criteria, which are derived from the European Directive 2004/18/EC, can be considered the reference criteria, while the national criteria which are the basis for individual public tenders in respective countries are considered the local criteria."
	},	{
		"sentence": "Figure 6 depicts the general taxonomy for the pre-VCD mapping concept, while Figure 7 shows a detailed taxonomy of the concept evidence."
	},	{
		"sentence": "With this taxonomy, it is possible to map the fact that evidences can either be provided by the candidate himself (e.g. self-declaration, declaration on oath, solemn statement) or specific issuers as certified authorities and/or [authorized] third parties."
	},	{
		"sentence": "Furthermore, evidences may be of different type such as statements, attestations or certificates, as indicated in Figure 7."
	},	{
		"sentence": "Overall, the pre-VCD mapping tool supports in the proof of compliance of evidences of one country to the requested selection and exclusion criteria of another country via a mapping to the European exclusion and selection criteria."
	},	{
		"sentence": "The respective retrieval of attestations and statements (6) and the subsequent steps (7-8) remain the ones as described in the status-quo description of section 1.2 above."
	},	{
		"sentence": "The use case diagram in Figure 8 shows the main actors and functions of stage 1 (pre-VCD mapping) in the context of a public tender."
	},	{
		"sentence": "A contracting authority sends a notification on a Call for Tender to a Publication body that publishes the call."
	},	{
		"sentence": "The Call for Tender contains the definition of evidences and the specific criteria on qualitative selection and exclusion that are relevant to this particular call."
	},	{
		"sentence": "If an economic operator decides to participate in a particular Call for Tender he can directly retrieve relevant information about evidences and criteria by using the information published in the Call for Tender.",
		"causality": {
			"cause": "an economic operator decides to participate in a particular Call for Tender",
			"effect": "he can directly retrieve relevant information about evidences and criteria by using the information published in the Call for Tender"
		}
	},	{
		"sentence": "In cases below threshold or in the cases where the public notice is partial, the economic operator might send a direct request to the contracting authority in order to retrieve the required information."
	},	{
		"sentence": "Having the relevant criteria in place the economic operator will be enabled to get a mapping to the national attestations that refer to those criteria via the pre-VCD mapping tool."
	},	{
		"sentence": "The same process can be performed by the contracting authority in order to check whether the submitted attestations adequately fulfil certain criteria asked for."
	},	{
		"sentence": "The pre-condition to the above flow of events is represented by the formal representation of imposed criteria, in particular for the qualification segments affecting, the technical, the financial and the quality criteria (as per directive 2004/18/EC_Arts. 47-50)."
	},	{
		"sentence": "Such formal representation has to be addressed along with the setting of the tool."
	},	{
		"sentence": "Besides the use of the pre-VCD mapping in actual tendering and procurement procedures, a system needs to be maintained which implements the mapping of European and national laws, and the agreements of mutual recognition among Member States (see use-case diagram depicted in Figure 9)."
	},	{
		"sentence": "The first feature to be addressed in this stage is the mapping between the criteria of qualitative selection and exclusion derived from Articles 45-50 of the Directive 2004/18/EC and the national attestations giving evidence to these criteria."
	},	{
		"sentence": "To handle the large set of ruling articles, which may especially vary in the national implementations (articles 47-50), arts 45 and 46 shall get a higher priority for a smooth implementation at first hand, while arts 47 to 50 will only be selectively implemented on the basis of specific and deeper analysis in the PEPPOL pilot contexts."
	},	{
		"sentence": "Due to the diversity and variability of evidences according to Art 51, this criterion will receive least priority in the implementations.",
		"causality": {
			"cause": "the diversity and variability of evidences according to Art 51",
			"effect": "this criterion will receive least priority in the implementations"
		}
	},	{
		"sentence": "This mapping includes at first hand an overview and transparency among national evidences and European criteria as shown in Figure 6 and Figure 7 above, including information about who issues specific evidence."
	},	{
		"sentence": "Further on, this mapping needs to be implemented in the pre-VCD mapping tool as depicted in the use-case diagram in Figure 9, i.e. a list of criteria to be matched is submitted to the entity performing the mapping."
	},	{
		"sentence": "Using the underlying technology, the mapping is done and its results, consisting of a list of the attestations giving evidence to the demanded criteria, can be transferred to a requester in case of a public tender."
	},	{
		"sentence": "The following requirements can be derived for stage 1."
	},	{
		"sentence": "Stage 1 is the key concept for ensuring interoperability between the different national systems of evidence provision in public procurement procedures."
	},	{
		"sentence": "Every higher stage will be depended on the mapping model defined in this stage."
	},	{
		"sentence": "Thus this stage will ensure the integration of different stages and interoperability as such."
	},	{
		"sentence": "Therefore each national service provider that provides a VCD (stage 2-4) and all relevant key other stakeholder such as economic operators, contracting authorities and certifiers must be able to retrieve the latest mapping information from the mapping facility."
	},	{
		"sentence": "The mapping facility MUST be accessible to all relevant key stakeholders such as economic operators, contracting authorities, certifiers and national service providers."
	},	{
		"sentence": "In order to derive sufficient mapping information the economic operator has to provide the criteria that are relevant to a particular call for tender."
	},	{
		"sentence": "The overall procedure would be simplified dramatically when the relevant criteria for a particular call for tender could be fetched either from a publication body or directly from the contracting authority.",
		"causality": {
			"cause": "the relevant criteria for a particular call for tender could be fetched either from a publication body or directly from the contracting authority",
			"effect": "The overall procedure would be simplified dramatically"
		}
	},	{
		"sentence": "The interaction with either the publication body or the communication with the contracting authority therefore has to be further defined."
	},	{
		"sentence": "The interaction between mapping facility and Publication Body / Contracting Authority should be defined in order to simplify the procedure to retrieve the relevant criteria for a particular Call for Tender."
	},	{
		"sentence": "The Identity and access management is an official procedure that handles roles for authorisation external to the VCD system and involves three actors, the economic operator, an officer and the VCD system itself as shown in Figure 11."
	},	{
		"sentence": "Economic operators have to apply for a VCD account and therefore they have to provide sensitive economic operator data (for example by uploading attestations to verify these data)."
	},	{
		"sentence": "Sensitive economic operator data must initially be provided by an economic operator (e.g. company registration number, VAT number, social insurance number of the company etc.) in order to create an account and to start any VCD packaging service."
	},	{
		"sentence": "An officer has to verify whether the provided data belongs to the economic operator and has to assure its correctness because either the VCD packaging service would not work or would deliver incomplete or wrong results.",
		"causality": {
			"cause": "either the VCD packaging service would not work or would deliver incomplete or wrong results",
			"effect": "An officer has to verify whether the provided data belongs to the economic operator and has to assure its correctness"
		}
	},	{
		"sentence": "After verification the officer creates a VCD account where sufficient data about the economic operator is stored."
	},	{
		"sentence": "In addition, identity and access management requires the possibility to delete an account within the VCD system and an official procedure to apply for a modification of the VCD account."
	},	{
		"sentence": "An economic operator can authenticate to the VCD system only when the economic operator has sufficient user rights (e.g. authorized representative of economic operator) provided by identity and access management as shown in Figure 12."
	},	{
		"sentence": "After authentication the economic operator can provide further tender specific data to the VCD system (e.g. TED ID) in order to start the creation of a VCD simple package."
	},	{
		"sentence": "The VCD system creates a suggestion for compilation according to the results provided by the pre-VCD mapping tool and in turn the economic operator can edit and confirm the compilation suggestion that is given by the VCD system as shown in Figure 13."
	},	{
		"sentence": "The function of creating a VCD package includes the collection of evidence (including translations) and structural evidence data through several sources."
	},	{
		"sentence": "Evidence and structural evidence data is provided by issuing bodies which can submit evidence and structural evidence data to the VCD system via an interface."
	},	{
		"sentence": "An important remark therefore is that economic operators can take the role of an issuing body by submitting for example candidate statements, manually collected evidence or translations of evidence."
	},	{
		"sentence": "The interface to submit evidence is defined through a service definition that allows adding specific structural evidence data that belongs to that evidence."
	},	{
		"sentence": "The collection of evidence is finalized when all required evidences are submitted and this requires waiting for those evidences that have to be provided manually or semi-automatically.",
		"causality": {
			"cause": "all required evidences are submitted and this requires waiting for those evidences that have to be provided manually or semi-automatically",
			"effect": "The collection of evidence is finalized"
		}
	},	{
		"sentence": "The VCD system can now compile the VCD package and creates a set of structural VCD package data that belong to the compilation process."
	},	{
		"sentence": "The economic operator can submit the VCD simple package to the contraction authority by using the VCD transportation system which is part of the PEPPOL infrastructure."
	},	{
		"sentence": "For using the VCD transportation system of WP8, both economic operators and contracting authorities have to authenticate to have access."
	},	{
		"sentence": "An important remark hereby is the usage of procurement platforms where bids are typically uploaded according to a given Call for Tender."
	},	{
		"sentence": "The transportation system of WP8 used by the VCD should be able to provide a possibility to send the VCD package directly to the contracting authority either by utilizing the upload functionality of a procurement platform or by directly sending the VCD to the contracting authority by using other means provided by the transportation system or typically used by the contracting authority."
	},	{
		"sentence": "It is also important to state that the transportation system does not necessarily have to be used by the economic operator."
	},	{
		"sentence": "The economic operator receives a VCD package by the VCD system and it is up to his choice how to submit the VCD package to the contracting authority."
	},	{
		"sentence": "Table 3 shows the additional benefits of stage 2 (first stage in four-stage VCD concept containing documents)."
	},	{
		"sentence": "The major aim of stage 2 is to draft logical systems that enable economic operators to create simple VCD packages and to submit them to contracting authorities."
	},	{
		"sentence": "Thereby stage 2 focuses on the necessary different logical systems that either provide major functionalities with regard to creating and viewing a VCD packages (VCD system) or which support the entire process such as authentication (Identity and Access management), transportation (VCD transportations system) or translation (VCD translation system)."
	},	{
		"sentence": "The general assumption of stage 2 is that the former pre-VCD mapping tool (stage 1) will be utilized as a module that is adequately integrated into the VCD system."
	},	{
		"sentence": "Stage 2 also introduces the idea of a national VCD service provider which operates the different services necessary to create and view a VCD package."
	},	{
		"sentence": "The national VCD service provider will provide a single-point of access to several attestations and issuing services that are electronically available."
	},	{
		"sentence": "Nevertheless it will be necessary to include other evidences that have to be provided semiautomatically or manually by the economic operator."
	},	{
		"sentence": "It also cannot be guaranteed that each evidentiary document required according to the criteria stated in the Call for Tender by the contracting authority can be pointed at with a particular mapping results of the pre-VCD mapping tool since some evidence diverge too much in their contents and scope.",
		"causality": {
			"cause": "some evidence diverge too much in their contents and scope",
			"effect": "It also cannot be guaranteed that each evidentiary document required according to the criteria stated in the Call for Tender by the contracting authority can be pointed at with a particular mapping results of the pre-VCD mapping tool"
		}
	},	{
		"sentence": "In those cases the VCD system will provide the possibility to add those documents into the VCD simple package through placeholders which may 09/11/2009 version 1.1 (approved by EC) have a very generic grounding for mapping defined through an abstract class of documents (e.g. evidence with regards to environmental management standards)."
	},	{
		"sentence": "When summarizing those points it can be generally stated that a VCD at stage 2 and beyond still relies on several manual processes that have to be generated by the economic operator and which cannot be automated in short or medium term.",
		"causality": {
			"cause": "summarizing those points",
			"effect": "it can be generally stated that a VCD at stage 2 and beyond still relies on several manual processes that have to be generated by the economic operator and which cannot be automated in short or medium term"
		}
	},	{
		"sentence": "However, a reduced scope of a VCD is necessary in order to provide the possibility to submit a VCD that has a sufficient level of completeness.",
		"causality": {
			"cause": "to provide the possibility to submit a VCD that has a sufficient level of completeness",
			"effect": "a reduced scope of a VCD is necessary"
		}
	},	{
		"sentence": "Another aim of stage 2 is to differentiate, define and structure the types of data that will constitute a VCD package."
	},	{
		"sentence": "Stage 2 does not focus on the re-development of existing evidentiary documents but on their extension through a common standard representation within a VCD."
	},	{
		"sentence": "The VCD package contains similar structural fields which likewise describe the evidences contained in it in similar manner, order and style."
	},	{
		"sentence": "Having similar structural layout of a VCD it will be easier to understand the contents of it and potentially to translated those structural key information from the language of the issuer or economic to the language of the contracting authority."
	},	{
		"sentence": "Nevertheless a translation of the contents of evidentiary documents is not focussed at in this stage and has to be provided manually by the economic operator through adding translations into the VCD simple package."
	},	{
		"sentence": "Stage 2 lays the ground for the further development of a VCD package towards an advanced package within stages 3."
	},	{
		"sentence": "The VCD package only focus on major functions that are necessary to create such a package and doesn't make use of other service that are introduced in the subsequent phases such as, recompiling an existing VCD package, usage of context-specific data and merging VCD packages of different economic operators into a single one."
	},	{
		"sentence": "The recompilation of existing VCD packages increases the maintainability of a VCD for the economic operator by for example indicating which evidence has to be replaced by a new one and which evidence has to be additionally provided in case preparing a bid for a different Call for Tender."
	},	{
		"sentence": "The usage of context-specific data thereby is an important precondition since these data can provide real-time information about the status of contents of the VCD which is needed in terms of making update proposals.",
		"causality": {
			"cause": "these data can provide real-time information about the status of contents of the VCD which is needed in terms of making update proposals",
			"effect": "The usage of context-specific data thereby is an important precondition"
		}
	},	{
		"sentence": "Also the merging of different VCD packages into a single unit to be used when consortia which prepare a bid as a multi-party group is not addressed in stage 2.",
		"causality": {
			"cause": "consortia which prepare a bid as a multi-party group is not addressed in stage 2",
			"effect": "the merging of different VCD packages into a single unit to be used"
		}
	},	{
		"sentence": "Figure 15 shows the possible system interactions of the actors with the VCD system and the auxiliary systems."
	},	{
		"sentence": "Figure 16 shows the possible interactions of the actors with the VCD system concerning the creation of a new VCD advanced package."
	},	{
		"sentence": "Figure 17 shows the possible interactions of the actors with the VCD system concerning the recompilation of an existing VCD package into a new VCD advanced package."
	},	{
		"sentence": "This use case contains the necessary steps an economic operator performs to create a new VCD advanced package."
	},	{
		"sentence": "This use case is similar to the use case 'Create VCD simple package' of stage 2 but adds the necessary functionality regarding context specific data and merging existing VCD packages into the new VCD advanced package."
	},	{
		"sentence": "This use case contains the necessary steps an economic operator performs to re-compile an existing VCD package into a new VCD advanced package."
	},	{
		"sentence": "This use case contains the necessary functionality regarding context specific data and merging existing VCD packages into the new VCD advanced package."
	},	{
		"sentence": "In order to merge VCD packages of several economic operators acting as one economic operator into one VCD package, the economic operator has to be able to provide these VCD packages to the VCD system.",
		"causality": {
			"cause": "the economic operator has to be able to provide these VCD packages to the VCD system",
			"effect": "merge VCD packages of several economic operators acting as one economic operator into one VCD package"
		}
	},	{
		"sentence": "In order to merge VCD packages of several economic operators acting as a single economic operator into one VCD package, the VCD system has to be able to consider data from several existing VCD packages in the compilation process.",
		"causality": {
			"cause": "the VCD system has to be able to consider data from several existing VCD packages in the compilation process",
			"effect": "merge VCD packages of several economic operators acting as a single economic operator into one VCD package"
		}
	},	{
		"sentence": "In order to be able to compile a VCD advanced package, the VCD compilation process must be extended to be able to process data from existing VCD packages of other economic operators and to process the context specific data that are included.",
		"causality": {
			"cause": "the VCD compilation process must be extended to be able to process data from existing VCD packages of other economic operators and to process the context specific data that are included",
			"effect": "be able to compile a VCD advanced package"
		}
	},	{
		"sentence": "Stage 4 does not contain a modelled use case diagram that clarifies the system interaction and a detailed description of requirements because it mainly relies on the functions introduced in the previous stages and there are no pilots yet for this stage.",
		"causality": {
			"cause": "it mainly relies on the functions introduced in the previous stages and there are no pilots yet for this stage",
			"effect": "Stage 4 does not contain a modelled use case diagram that clarifies the system interaction and a detailed description of requirements"
		}
	},	{
		"sentence": "Nevertheless the use case description provides a short textual explanation and major requirements of this stage are mentioned."
	},	{
		"sentence": "Functions in round brackets are new to this use case: The economic operator requests a VCD on the basis of stages 1, 2 and 3 at the National Service Provider."
	},	{
		"sentence": "The National Service Provider starts the VCD creation process by requesting attestations from Trusted Attestation Services that are connected to context specific networks."
	},	{
		"sentence": "Trusted Attestation Services provide requested attestations to a local database or repository that is owned by the National VCD Service Provider (store attestation)."
	},	{
		"sentence": "The VCD system enables the economic operator to mandate the contracting authority to access his attestations within the VCD system if the attestations are sufficiently described through context specific data and the VCD system creates a specific reference into the VCD itself.",
		"causality": {
			"cause": "the attestations are sufficiently described through context specific data and the VCD system creates a specific reference into the VCD itself",
			"effect": "The VCD system enables the economic operator to mandate the contracting authority to access his attestations within the VCD system"
		}
	},	{
		"sentence": "When all attestations are compiled by the VCD system the economic operator can submit its VCD to the contracting authority.",
		"causality": {
			"cause": "all attestations are compiled by the VCD system",
			"effect": "the economic operator can submit its VCD to the contracting authority"
		}
	},	{
		"sentence": "The contracting authority can now request attestations through the reference that is specified in the VCD (request attestation on individual basis)."
	},	{
		"sentence": "The VCD System checks whether the contracting authority has sufficient access rights and has been mandated by the economic operator to retrieve that attestation (check access rights)."
	},	{
		"sentence": "Afterwards the VCD system delivers the attestation to the contracting authority (retrieve attestation) or informs the economic about a request that cannot be handled adequately (conflict resolution)."
	},	{
		"sentence": "The economic operator than may have to provide an additional translation to the contracting authority within a certain period of time."
	},	{
		"sentence": "The organisational framework for the VCD has several dimensions."
	},	{
		"sentence": "The use cases of the stages above show the actors that are involved and have to be addressed through the organisational framework e.g. economic operators, contracting authorities, issuing bodies, national service providers etc."
	},	{
		"sentence": "Within the project it will be necessary to manage these different kinds of stakeholders by adequately integrating them into the project."
	},	{
		"sentence": "Thereby it will be of importance to define their specific role and their importance for our work package within the lifetime of the project."
	},	{
		"sentence": "Networks of gathering evidences are complex to handle because there are several stakeholders to consider.",
		"causality": {
			"cause": "there are several stakeholders to consider",
			"effect": "Networks of gathering evidences are complex to handle"
		}
	},	{
		"sentence": "To avoid problems of involvement a clear approach of stakeholder analysis is needed."
	},	{
		"sentence": "WP2 can only provide guidance to this since it will be a national responsibility.",
		"causality": {
			"cause": "it will be a national responsibility",
			"effect": "WP2 can only provide guidance to this"
		}
	},	{
		"sentence": "Austria for example has set up a physical stakeholder forum that informs key stakeholder in regular time intervals about the results of PEPPOL."
	},	{
		"sentence": "Next to this the WP2 team of Austria is building up a participation platform13 where latest results are presented and can be further discussed within forums and mini surveys."
	},	{
		"sentence": "Each member state has to define its own strategy to involve stakeholders during the lifetime of the project."
	},	{
		"sentence": "WP2 has developed a template for stakeholder management that may provide guidance for this."
	},	{
		"sentence": "It can be found in ANNEX IV: Template for stakeholder analysis."
	},	{
		"sentence": "To ensure a wide acceptance of the solutions provided by WP2 among stakeholders we have to prevent changes in national procedures and infrastructures but to utilize them as much as possible."
	},	{
		"sentence": "In stages 2, 3 and 4 it will be necessary to establish a national service provider who will take care about critical VCD processes and therewith ensure legitimacy, trust and appropriate change management."
	},	{
		"sentence": "Any VCD solution should provide universal support for economic operators of any size."
	},	{
		"sentence": "Testing of a VCD solution will be very important and should be done by reprocessing historical tenders in order to avoid problems of disqualification due to errors of applications."
	},	{
		"sentence": "Another important part of the stakeholder analysis is the identification of recognized public and private issuing bodies."
	},	{
		"sentence": "This may be done through the support of DG Markts study (Siemens_and_Time.lex 2007) report on national country profiles14 and additional national analysis."
	},	{
		"sentence": "These entities then need to be included into a list of recognized private and public issuing bodies which will be an important part when defining structural data of evidence (e.g. issuer, availability, delivery time etc)."
	},	{
		"sentence": "A national VCD application may list several different issuing bodies that provide the same attestation."
	},	{
		"sentence": "These may have different characteristics as for example price, availability or delivery time."
	},	{
		"sentence": "However the choice which attestation is most appropriate should be left to the economic operator but this decision may be supported through displaying these different characteristics."
	},	{
		"sentence": "If an economic operator for example decides to rely on a manual issuing service that cannot be directly invoked by a national service provider it is the responsibility of the economic operator to provide this attestation and act as issuing body by uploading it to the system of the national service provider in order to create a VCD package.",
		"causality": {
			"cause": "an economic operator for example decides to rely on a manual issuing service that cannot be directly invoked by a national service provider",
			"effect": "it is the responsibility of the economic operator to provide this attestation and act as issuing body by uploading it to the system of the national service provider in order to create a VCD package"
		}
	},	{
		"sentence": "Each national service provider provides a national VCD solution in accordance to the key principles mentioned in the use cases."
	},	{
		"sentence": "National solutions therefore may vary due to freedom of implementing national solutions but conformance to key issues should ensure their interoperability."
	},	{
		"sentence": "A key issue for example is the pre-VCD mapping tool and it should be integrated into any national solutions either as a module or as interface to query results for the mapping of evidences among member states."
	},	{
		"sentence": "To enable automated information processing on the basis of the pre-VCD mapping tool within national solutions additional structured information has to be defined within the Call for Tender that enables the retrieval of qualification and selection criteria from contracting authorities."
	},	{
		"sentence": "A contracting authority therefore has to specify a relevant criteria subset within a Call for Tender which can then for example be referred to by an economic operator by providing the ID of a Call for Tender to the national solution."
	},	{
		"sentence": "Two phased tendering is not explicitly foreseen by the VCD even if it might be used for this purpose."
	},	{
		"sentence": "In most cases we do not see great efforts for economic operators in two-phased since many countries only required the submission of self-declarations.",
		"causality": {
			"cause": "many countries only required the submission of self-declarations",
			"effect": "In most cases we do not see great efforts for economic operators in two-phased"
		}
	},	{
		"sentence": "None of the above mentioned solutions explicitly requires implementing Article 52 of directive 2004/18/EC."
	},	{
		"sentence": "Thus the VCD itself provides support for the proofing of conformance but it does not provide any information whether an economic operator is conform."
	},	{
		"sentence": "In stages 3 and 4 a higher-level of decision making is promoted and we see especially the provision of context specific data (stage 3) and the on demand approach (stage 4) as a pre-conditions that ease the establishment of lists of approved economic operators across borders."
	},	{
		"sentence": "However if there is a country that wishes to enable such a proof in the VCD it can be done before but will require several manual efforts.",
		"causality": {
			"cause": "there is a country that wishes to enable such a proof in the VCD",
			"effect": "it can be done before but will require several manual efforts"
		}
	},	{
		"sentence": "Although such proof of conformance should rely on Articles 45 and 46 of directive 2004/18/EC first."
	},	{
		"sentence": "The requirements listed in the subsequent section have been identified and are essential for any WP2 solution."
	},	{
		"sentence": "They are independent of a particular stage or show interrelations between them thus they are called high-level organisational requirements.",
		"causality": {
			"cause": "They are independent of a particular stage or show interrelations between them",
			"effect": "they are called high-level organisational requirements"
		}
	},	{
		"sentence": "The requirements have to be fulfilled or further analysed and specified in the project lifetime in order to further draft the organisational framework for a VCD to a greater extend."
	},	{
		"sentence": "Article 52 describes that Member States may introduce either official lists of approved contractors, suppliers or service providers or certification by certification bodies established in public or private law."
	},	{
		"sentence": "A list of recognized public authorities that are able to issue certain attestations in a particular Member State MUST be established."
	},	{
		"sentence": "List of recognized public attestation bodies in VCD index."
	},	{
		"sentence": "Article 52 describes that Member States may introduce either official lists of approved contractors, suppliers or service providers or certification by certification bodies established in public or private law."
	},	{
		"sentence": "A list of recognized private entities that are able to issue certain attestations in a particular Member State SHOULD be established."
	},	{
		"sentence": "List of recognized public attestation bodies in VCD index."
	},	{
		"sentence": "Widely accepted national procedures and infrastructures in requesting, issuing, exchanging, collecting, assembling, proving and submitting evidence should be utilized wherever possible in order to improve acceptance of a solution and in order to lower the complexity of the domain.",
		"causality": {
			"cause": "Widely accepted national procedures and infrastructures in requesting, issuing, exchanging, collecting, assembling, proving and submitting evidence should be utilized wherever possible",
			"effect": "improve acceptance of a solution and in order to lower the complexity of the domain"
		}
	},	{
		"sentence": "Widely accepted national procedures and infrastructures SHOULD be utilized wherever possible."
	},	{
		"sentence": "Acceptance of the solution among stakeholders."
	},	{
		"sentence": "A national authority (e.g. national service provider) should ensure legitimacy in critical VCD processes of requesting, issuing, exchanging, collecting, assembling, proving and submitting evidence in order to increase the trust between the entities involved.",
		"causality": {
			"cause": "A national authority (e.g. national service provider) should ensure legitimacy in critical VCD processes of requesting, issuing, exchanging, collecting, assembling, proving and submitting evidence",
			"effect": "increase the trust between the entities involved"
		}
	},	{
		"sentence": "A national authority MUST support critical processes in order to increase the trust between the entities involved.",
		"causality": {
			"cause": "A national authority MUST support critical processes",
			"effect": "increase the trust between the entities involved"
		}
	},	{
		"sentence": "Establishment of legally regulated national service provider for the VCD."
	},	{
		"sentence": "The common ground for WP2 is the establishment of national pilot solutions that ensure interoperability of attestations across Member States."
	},	{
		"sentence": "Therefore WP 2 has defined a pre-VCD mapping tool described in stage 1."
	},	{
		"sentence": "Any national pilot solution that will be developed using resources of PEPPOL must use the pre-VCD mapping tool in order to achieve the desired objectives."
	},	{
		"sentence": "Any national pilot solution that will be developed in the context of PEPPOL WP2 has to follow the pre- VCD mapping defined in stage 1."
	},	{
		"sentence": "Conformance between the processing of different national VCD services has to be ensured, monitored and surveyed by a European VCD service provider that needs to be set up with defined responsibilities and procedures."
	},	{
		"sentence": "The European VCD service provider will maintain the common descriptions and monitor the development of the national solutions and assess their conformance to a common European interface (i.e. the pre-VCD mapping tool)."
	},	{
		"sentence": "VCD packages need to provide mapping functionality with the pre-VCD mapping tool."
	},	{
		"sentence": "The implementation of a national VCD solution in stages 2, 3 and 4 requires a wide degree of freedom in implementing this solution according to national conditions and requirements."
	},	{
		"sentence": "Specific national functionalities of pilot solutions therefore are not subject to discussions and agreements between different WP partners as long as they follow the common interoperability guidelines of the specification.",
		"causality": {
			"cause": "they follow the common interoperability guidelines of the specification",
			"effect": "Specific national functionalities of pilot solutions therefore are not subject to discussions and agreements between different WP partners"
		}
	},	{
		"sentence": "National implementations of VCD systems and their functions are no subject to discussions and agreements between WP partners as long as they follow common interoperability guidelines that will be monitored by the European VCD Service Provider.",
		"causality": {
			"cause": "National implementations of VCD systems and their functions are no subject to discussions and agreements between WP partners",
			"effect": "they follow common interoperability guidelines that will be monitored by the European VCD Service Provider"
		}
	},	{
		"sentence": "Conformance with common interoperability guidelines that will be monitored by the European VCD Service Provider."
	},	{
		"sentence": "Article 5215 describes that EU Member States may introduce either official lists of approved contractors, suppliers or service providers or certification by certification bodies established in public or private law."
	},	{
		"sentence": "Pilots implemented in stages 1, 2, 3 and 4 produce VCD artefacts that enable matching between attestations and certain criteria across borders and the implementation of the VCD package."
	},	{
		"sentence": "This does not include that any check or proof of conformance is performed by any national service provider who provides a VCD package with regard to the contents of the package and its attestation as for example describe in Article 52 of the directive."
	},	{
		"sentence": "In stages 1, 2, 3 and potentially also in stage 4 the check and proof of conformance belongs to the economic operator himself."
	},	{
		"sentence": "Nevertheless any stage may be implemented according to Article 52 if there is adequate legal basis within a country and if there is political commitment for doing so."
	},	{
		"sentence": "Stage 4 is providing a good opportunity to implement Article 52."
	},	{
		"sentence": "A national pilot solution may implement attestation validation feature but proof of conformance and checking is not a mandatory feature that has to be fulfilled by a national service provider."
	},	{
		"sentence": "National Service Provider does not have to approve the documents submitted by economic operators Requirement Any of the proposed stages SHOULD be applicable within a Member State who wishes to apply Article 52 and EFTA EEA Committee decision 68/2006."
	},	{
		"sentence": "A Member State must formally define an authority that is able to provide a proof of conformance to certain criteria if the Member State wishes to implement Article 52 or if Article 52 is already implemented.",
		"causality": {
			"cause": "the Member State wishes to implement Article 52 or if Article 52 is already implemented",
			"effect": "A Member State must formally define an authority that is able to provide a proof of conformance to certain criteria"
		}
	},	{
		"sentence": "Authority that takes the role of validation point and Article 52 implemented."
	},	{
		"sentence": "A contracting authority sends a notification on a Call for Tender to a Publication body that publishes the call."
	},	{
		"sentence": "The Call for Tender contains the definition of relevant evidences and specifies the relevant criteria on qualitative selection and exclusion."
	},	{
		"sentence": "If an economic operator decides to participate in a particular Call for Tender he can directly retrieve the relevant criteria and evidences by using the information published in the Call for Tender.",
		"causality": {
			"cause": "an economic operator decides to participate in a particular Call for Tender",
			"effect": "he can directly retrieve the relevant criteria and evidences by using the information published in the Call for Tender"
		}
	},	{
		"sentence": "In cases below threshold the economic operator might send a direct request to the contracting authority in order to retrieve the required information."
	},	{
		"sentence": "Having the relevant criteria in place the economic operator will be enabled to get a mapping to the national attestations that refer to those criteria via the pre-VCD mapping tool."
	},	{
		"sentence": "The contracting authority has to specify a subset of the superset of criteria that is relevant to a specific Call for Tender so that any VCD application can perform the mapping later on Measurement Development of standard template for specifying criteria as part of tender-specific data.",
		"causality": {
			"cause": "The contracting authority has to specify a subset of the superset of criteria that is relevant to a specific Call for Tender",
			"effect": "any VCD application can perform the mapping later on Measurement Development of standard template for specifying criteria as part of tender-specific data"
		}
	},	{
		"sentence": "If an economic operator decides to participate in a particular Call for Tender he can directly retrieve information about relevant evidences and related criteria by using the information published in the Call for Tender.",
		"causality": {
			"cause": "an economic operator decides to participate in a particular Call for Tender",
			"effect": "he can directly retrieve information about relevant evidences and related criteria by using the information published in the Call for Tender"
		}
	},	{
		"sentence": "In cases below threshold the economic operator might send a direct request to the contracting authority in order to retrieve the required information."
	},	{
		"sentence": "Having the relevant evidences and criteria in place the economic operator will be enabled to get a mapping to the national attestations that refer to those criteria via the pre-VCD mapping tool."
	},	{
		"sentence": "The economic operator therefore has to provide a subset of the superset of evidences that is relevant to a specific Call for Tender to its National Service Provider or VCD system."
	},	{
		"sentence": "Any VCD system must have an interface to provide tender-specific data and (in particular the relevant criteria subset) in order to perform the mapping."
	},	{
		"sentence": "Interface for providing tender specific data and in particular the relevant criteria subset."
	},	{
		"sentence": "The VCD is subject to the main submission of attestations and not to any pre-submission typically required in two-phased tendering."
	},	{
		"sentence": "A national pilot VCD solution may support the pre-submission of evidence as well."
	},	{
		"sentence": "The main subject of the VCD is the final submission of evidence to the contracting authority Measurement VCD package supports final submission of evidence."
	},	{
		"sentence": "There are often multiple issuing bodies available which provide evidence of the same kind but with different characteristics such as cheap issuing services and fast issuing services."
	},	{
		"sentence": "The requestor has to decide by himself which issuing service is most appropriate to satisfy his needs."
	},	{
		"sentence": "A pre-selection of issuing services could be provided by the VCD system."
	},	{
		"sentence": "If there are multiple ways to provide evidence the choice of selecting a specific issuing service is left to the requester.",
		"causality": {
			"cause": "there are multiple ways to provide evidence",
			"effect": "the choice of selecting a specific issuing service is left to the requester"
		}
	},	{
		"sentence": "Functionality and interface to select issuing services."
	},	{
		"sentence": "Any VCD system relies on issuing services that cannot directly invoked electronically."
	},	{
		"sentence": "Often the VCD system will have the possibility to specify the issuing services that are needed to evidence certain criteria e.g. candidate statements or attestations from third parties that are not available in electronic format."
	},	{
		"sentence": "An Economic Operators must take care of collecting and preparing these evidences and to submit them to the VCD system."
	},	{
		"sentence": "An economic operator must be able to act as an issuing body for candidate statements or other evidence that cannot be directly or electronically retrieved by the VCD system."
	},	{
		"sentence": "Functionality and interface that enable economic operator to upload any kind of evidence to the VCD."
	},	{
		"sentence": "E-business is relevant to organizations of any size."
	},	{
		"sentence": "Traditionally only larger organizations have been able to take advantage of e-business primarily due to the cost barrier."
	},	{
		"sentence": "The evolution on the Internet has shown that as soon as the barrier for entry is lowered enough even the smallest organizations will take advantage of the new technology."
	},	{
		"sentence": "It is therefore important that when new technology is established that the barrier for taking up the technology is sufficiently low."
	},	{
		"sentence": "WP2 concentrates on pre-awarding issues where requirements and procedures are often strict due to principles like equal treatment, non-discrimination, transparency, competition etc."
	},	{
		"sentence": "Although a VCD does not include the offer itself it provides several documents that are of great importance for the award of contracts and therewith critical for the success of an economic operator for example in cases of disqualification because of late delivery of a VCD."
	},	{
		"sentence": "To avoid those problems testing of VCD should be done by reprocessing historical tenders."
	},	{
		"sentence": "The VCD solutions MUST be tested in specific cases by re-processing historical tenders."
	},	{
		"sentence": "The testing SHOULD be repeated regularly and especially after up-dating of software."
	},	{
		"sentence": "A national solution will only be authorized to operate cross-border when all tests are passed.",
		"causality": {
			"cause": "all tests are passed",
			"effect": "A national solution will only be authorized to operate cross-border"
		}
	},	{
		"sentence": "The testing has to be maintained and monitored by the European VCD Service Provider."
	},	{
		"sentence": "Stakeholder MUST be found in order to re-process historical tenders."
	},	{
		"sentence": "The following subsections contain major standards and methodologies that shall be used for creating a VCD package."
	},	{
		"sentence": "The mentioned metadata standards and the standards for record management are currently investigated for the purpose of our work package."
	},	{
		"sentence": "Beside this CEN BII16 develops a VCD profile that can be interpreted and used by systems based on both UN/CEFACT and UBL."
	},	{
		"sentence": "A selection of such documents will be included in any VCD; they will be produced by national units according to national legislation."
	},	{
		"sentence": "This means that their content of data and information will vary."
	},	{
		"sentence": "Both manual and automated cross border evaluation processes will require information about the legal validity of the documents, record by record."
	},	{
		"sentence": "This means that the records of these documents need to be tagged for the processing."
	},	{
		"sentence": "The label can give access to contextual information, like a country's legislation and constraints valid for the very document."
	},	{
		"sentence": "Methods are specified in ISO 15489-117, and European requirements are detailed in MOREQ II18."
	},	{
		"sentence": "Application of the standard will ease manual processing of such documents across borders and it will prepare for the use of automation."
	},	{
		"sentence": "Tagged records, information and data can be processed by independent systems and applications only if the constraining tags or metadata are recognized by the different processing parties.",
		"causality": {
			"cause": "the constraining tags or metadata are recognized by the different processing parties",
			"effect": "Tagged records, information and data can be processed by independent systems and applications"
		}
	},	{
		"sentence": "ISO 1117919 offers such a methodology that is widely accepted."
	},	{
		"sentence": "The purpose of ISO/IEC 11179 is to give concrete guidance on the formulation and maintenance of discrete data element descriptions and semantic content (metadata) that shall be used to formulate data elements in a consistent, standardized manner."
	},	{
		"sentence": "CEN BII is addressing the convergence between UN/CEFACT and UBL by working out neutral descriptions called profiles that are describing business operational units of business functionality, like the VCD."
	},	{
		"sentence": "The CEN BII VCD profile will be a document that can be interpreted and used by systems based on both UN/CEFACT and on UBL."
	},	{
		"sentence": "The process of a cross-border submission of the VCD will be done co-jointly with the CEN BII workshop."
	},	{
		"sentence": "Hence, the use of ISO 15489 and ISO 11179 leads to standardised records and information management that can be automated in existing structures."
	},	{
		"sentence": "The requirements listed in the subsequent section have been identified and are essential for any WP2 solution."
	},	{
		"sentence": "They are independent of a particular stage or show interrelations between them thus they are called high-level semantic requirements."
	},	{
		"sentence": "The requirements have to be fulfilled or further analysed and specified in the project lifetime in order to further draft the semantic framework for a VCD to a greater extend."
	},	{
		"sentence": "Semantic interoperability refers to the exchange of information in an understandable way within and across organizational borders."
	},	{
		"sentence": "To run real electronic business transactions without human intervention, semantic interoperability must be achieved."
	},	{
		"sentence": "Deliverables from CEN BII are addressing semantic interoperability for some business documents relevant in electronic procurement."
	},	{
		"sentence": "Outcomes from CEN BII are syntax neutral, which means that different syntaxes can be bound to the semantic requirements for the documents to be exchanged meaningfully despite their syntax."
	},	{
		"sentence": "Even if syntax interoperability is not achieved in a pan-European framework, it has to be possible to transform from a syntax vocabulary to another one without loosing.",
		"causality": {
			"cause": "syntax interoperability is not achieved in a pan-European framework",
			"effect": "it has to be possible to transform from a syntax vocabulary to another one without loosing"
		}
	},	{
		"sentence": "Semantic interoperability should apply to all documents related with electronic procurement."
	},	{
		"sentence": "It is required to work on the semantic interoperability for electronic attestations and certificates that requires not only semantic alignment but legal alignment in Europe."
	},	{
		"sentence": "Evidential documents exchanged between parties must be semantically harmonized in order to be processed electronically.",
		"causality": {
			"cause": "Evidential documents exchanged between parties must be semantically harmonized",
			"effect": "be processed electronically"
		}
	},	{
		"sentence": "National criteria for qualitative selection and exclusion should be formulated in a way that they can be mapped to European criteria for qualitative selection and exclusion mentioned by the Articles 45-50."
	},	{
		"sentence": "National criteria for qualitative selection and exclusion MUST correspond to European criteria which are derived from Article 45-50 and which are partially described in the Eligibility of Tenders."
	},	{
		"sentence": "Specialization Relationship Requirement National criteria SHOULD be consistent among themselves and with European criteria."
	},{
		"sentence": "Any instance of a VCD requires to be defined for a particular economic operator."
	},	{
		"sentence": "Next to this it is the aim of the work package to make each VCD specific to a particular Call for Tender."
	},	{
		"sentence": "The pre-VCD mapping tool therefore will provide sufficient support and has to be integrated into a VCD system."
	},	{
		"sentence": "Any VCD instance MUST be specific with regards to a certain economic operator."
	},	{
		"sentence": "Any VCD instance SHOULD be specific with regards to a certain tender."
	},	{
		"sentence": "A unique VCD identifier needs to be established."
	},	{
		"sentence": "VCD can be applied to a specific tender and economic operator."
	},	{
		"sentence": "A VCD package will show its full potential only when all requested evidences are contained within it.",
		"causality": {
			"cause": "all requested evidences are contained within it",
			"effect": "A VCD package will show its full potential"
		}
	},	{
		"sentence": "The range of attestations varies from selfdeclarations to official attestations/certificates issued by public authorities."
	},	{
		"sentence": "From a very pragmatic point of view it seems reasonable to focus on a subset of attestations in a first step and to complete the VCD Package later on."
	},	{
		"sentence": "It is also reasonably to define, where and when permitted, a default packaging list of tender independent criteria to be served without the burden of reading or interpreting the Call for Tender."
	},	{
		"sentence": "Several requirements can be derived."
	},	{
		"sentence": "When implementing any tool, system or service WP2 must focus on mandatory requirements and evidences mentioned in Articles 45 and 46 first since theses Articles are not tender-specific and therewith relevant for nearly all tenders.",
		"causality": {
			"cause": "implementing any tool, system or service",
			"effect": "WP2 must focus on mandatory requirements and evidences mentioned in Articles 45 and 46 first since theses Articles are not tender-specific and therewith relevant for nearly all tenders"
		}
	},	{
		"sentence": "Any definition, specification, modelling or implementation will first focus on Article 45 to 46."
	},	{
		"sentence": "The mapping between evidences via requirements MUST have set a primary focus on the mandatory requirements and evidences of a VCD."
	},	{
		"sentence": "The definition, specification, modelling or implementation of the pre-VCD mapping tool will focus on Articles 45 to 46."
	},	{
		"sentence": "Articles 47 to 50 open a wide range of different criteria which are tender- and country-specific thus they must be added stepwise to the pre-VCD mapping tool (which may require a higher-level mapping).",
		"causality": {
			"cause": "Articles 47 to 50 open a wide range of different criteria which are tender- and country-specific",
			"effect": "they must be added stepwise to the pre-VCD mapping tool (which may require a higher-level mapping)"
		}
	},	{
		"sentence": "Any definition, specification, modelling or implementation of Articles 47 to 50 will be done on a higher level."
	},	{
		"sentence": "Any VCD system SHOULD provide the opportunity to the economic operator to produce a complete VCD even if there are several issuing services that are not under control of a national service provider, do not have specific mapping to other documents defined in the pre-VCD mapping tool and have to be provided by the economic operator manually.",
		"causality": {
			"cause": "there are several issuing services that are not under control of a national service provider, do not have specific mapping to other documents defined in the pre-VCD mapping tool and have to be provided by the economic operator manually",
			"effect": "Any VCD system SHOULD provide the opportunity to the economic operator to produce a complete VCD"
		}
	},	{
		"sentence": "The VCD solution includes a concept of placeholders."
	},	{
		"sentence": "Since the completeness of a VCD package should be ensured but a complete mapping of evidence may not be provided as especially the criteria of Articles 49 to 50 of the directive are unstructured and much dependent on tender-specific requirements it has to be possible to define placeholders where a contracting authority may complete the mapping on individual basis through uploading evidence to these placeholders.",
		"causality": {
			"cause": "the completeness of a VCD package should be ensured but a complete mapping of evidence may not be provided as especially the criteria of Articles 49 to 50 of the directive are unstructured and much dependent on tender-specific requirements",
			"effect": "it has to be possible to define placeholders where a contracting authority may complete the mapping on individual basis through uploading evidence to these placeholders"
		}
	},	{
		"sentence": "Any VCD system provides the functionality to add additional documents through placeholders."
	},	{
		"sentence": "Conceptual definition of placeholders with the VCD system and mapping."
	},	{
		"sentence": "The VCD system should provide a functionality that allows issuing bodies to submit evidence to it."
	},	{
		"sentence": "Therefore interfaces to submit evidence to the VCD system have to be defined."
	},	{
		"sentence": "Those interfaces should also provide the possibility to describe structural data, context specific data and where applicable validation values of the evidence along with common semantics."
	},	{
		"sentence": "Thereby manual, semiautomated and automated interfaces have to be separated."
	},	{
		"sentence": "Interfaces to submit evidence to the VCD system have to be defined along with common semantics in order to allow issuing bodies to further specify evidence with regard to structural data, context specific data and validation values.",
		"causality": {
			"cause": "Interfaces to submit evidence to the VCD system have to be defined along with common semantics",
			"effect": "allow issuing bodies to further specify evidence with regard to structural data, context specific data and validation values"
		}
	},	{
		"sentence": "Interface to upload evidence or to retrieve evidence contains possibility to specify structural data manually or automatically."
	},	{
		"sentence": "Any VCD package that is created by a VCD system should be an artefact that can be interpreted without using specific technology."
	},	{
		"sentence": "Thereby the VCD requires a sufficient format in order to be presented and displayed to other systems and users.",
		"causality": {
			"cause": "the VCD requires a sufficient format",
			"effect": "be presented and displayed to other systems and users"
		}
	},	{
		"sentence": "Develop a format that allows the presentation and displaying of the contents of a VCD package."
	},	{
		"sentence": "Visualization of the VCD package."
	},	{
		"sentence": "The implementation of different stages of maturity requires a general approach that defines which parts are mandatory and ensure semantic interoperability of VCD packages."
	},	{
		"sentence": "The below mentioned requirements provide guidance for and further explain where mandatory and optional requirements can be found."
	},	{
		"sentence": "The pre-VCD mapping tool (Stage 1) must be filled with instances (defined) by every Member State since Stage 1 is a precondition for any other stage.",
		"causality": {
			"cause": "Stage 1 is a precondition for any other stage",
			"effect": "The pre-VCD mapping tool (Stage 1) must be filled with instances (defined) by every Member State"
		}
	},	{
		"sentence": "The VCD simple package (Stage 2) lays the basic ground for the creation of VCDs and the implementation of other services mentioned in stages 3 and 4 so the key concepts of Stage 2 MUST be implemented in each Member States."
	},	{
		"sentence": "Stage 3 (VCD advanced package) and stage 4 (VCD networked package) introduce a set of optional functions that SHOULD be considered by each Member State when implementing a VCD."
	},	{
		"sentence": "The stages are logically built upon each other but it must be possible to implement certain features of stage 4 if the necessary requirements for this are fulfilled in the lower stages even if maybe not all requirements are fulfilled in stage 3.",
		"causality": {
			"cause": "the necessary requirements for this are fulfilled in the lower stages even if maybe not all requirements are fulfilled in stage 3",
			"effect": "The stages are logically built upon each other but it must be possible to implement certain features of stage 4"
		}
	},	{
		"sentence": "Stage 4 implies the exchange of certified validation values (e.g. certified Yes/No statements) instead of delivering an attestation."
	},	{
		"sentence": "The attestations can be requested by the contracting authority on individual basis at the time of awarding and selection of candidates."
	},	{
		"sentence": "Validation values (e.g. certified Yes/No statements) should only be applied to networks where sufficient context specific data is available in order to approve this value."
	},	{
		"sentence": "The validation value should be able to prove conformance to criteria of qualitative exclusion and selection unambiguously."
	},	{
		"sentence": "This principle should be applied wherever possible for example: The economic operator has to prove that he paid fiscal taxes according to national regulations in this case a Yes/No statement will be sufficient."
	},	{
		"sentence": "The economic operator has to provide balance sheet or extracts from it in order to proof its economic or financial standing - in this case the whole attestation (balance sheet or extracts of it) has to be delivered."
	},	{
		"sentence": "If sufficient context specific data format for representing those information unambiguously is available it may be applied for stage 4.",
		"causality": {
			"cause": "sufficient context specific data format for representing those information unambiguously is available",
			"effect": "it may be applied for stage 4"
		}
	},	{
		"sentence": "PEPPOL WP2 is not focussing on the creation of context-specific data of attestations or candidate statements in multilingual versions."
	},	{
		"sentence": "If context-specific data is provided in multilingual versions (e.g. XBRL, ECRIS etc.) this has a high priority to be included into stage 3 and stage 4.",
		"causality": {
			"cause": "context-specific data is provided in multilingual versions (e.g. XBRL, ECRIS etc.)",
			"effect": "this has a high priority to be included into stage 3 and stage 4"
		}
	},	{
		"sentence": "If attestations are described sufficiently in multiple lingual versions they should be included first to stages 3 and 4.",
		"causality": {
			"cause": "attestations are described sufficiently in multiple lingual versions",
			"effect": "they should be included first to stages 3 and 4"
		}
	},	{
		"sentence": "If the prove concentrates on qualitative aspects (e.g. provide balance sheet or extracts from it in order to proof its economic or financial standing) then the validation value cannot be applied.",
		"causality": {
			"cause": "the prove concentrates on qualitative aspects (e.g. provide balance sheet or extracts from it in order to proof its economic or financial standing)",
			"effect": "the validation value cannot be applied"
		}
	},	{
		"sentence": "Instead such an attestation can be included into VCD stages 3 and 4 if it is sufficiently described through context specific data in multilingual versions (e.g. XBRL, ECRIS etc.).",
		"causality": {
			"cause": "it is sufficiently described through context specific data in multilingual versions (e.g. XBRL, ECRIS etc.)",
			"effect": "such an attestation can be included into VCD stages 3 and 4"
		}
	},	{
		"sentence": "A classification scheme is the descriptive information for an arrangement or division of objects into groups based on characteristics that the objects have in common 20."
	},	{
		"sentence": "Classification schemes and code lists conveys semantics to the objects so they are a key factor to achieve semantic interoperability."
	},	{
		"sentence": "Different industries provide specific classification schemes for their products or services."
	},	{
		"sentence": "As it is quite complex to establish a common and unique classification scheme cross-border and cross-sector, business document instances should be carry metadata about classification schemes they use.",
		"causality": {
			"cause": "it is quite complex to establish a common and unique classification scheme cross-border and cross-sector",
			"effect": "business document instances should be carry metadata about classification schemes they use"
		}
	},	{
		"sentence": "Classification schemes for goods, services and code lists SHOULD be publicly available and identified in the document objects."
	},	{
		"sentence": "The requirements listed in the subsequent section have been identified as essential for any WP2 solution."
	},	{
		"sentence": "They are independent of a particular stage."
	},	{
		"sentence": "The requirements have to be fulfilled or further analysed and specified in order to further draft the legal framework for a VCD to a greater extent.",
		"causality": {
			"cause": "The requirements have to be fulfilled or further analysed and specified",
			"effect": "further draft the legal framework for a VCD to a greater extent"
		}
	},	{
		"sentence": "The principle of equal treatment is often mentioned by the directive 2004/18/EC for example in connection with contracts that should be awarded on the basis of objective criteria which ensure compliance with the principles of transparency, non-discrimination and equal treatment and which guarantee that tenders are assessed in conditions of effective competition."
	},	{
		"sentence": "The VCD package should ensure equal treatment of foreign economic operators by providing a tool to submit evidence from one member state to another."
	},	{
		"sentence": "Therefore Article 52(5) states that economic operators from other Member States may not be obliged to undergo such registration or certification in order to participate in a public contract."
	},	{
		"sentence": "The contracting authorities shall recognise equivalent certificates from bodies established in other Member States."
	},	{
		"sentence": "They shall also accept other equivalent means of proof."
	},	{
		"sentence": "The VCD SHOULD support that economic operators from foreign member states may not be treated harder than own member state's economic operators."
	},	{
		"sentence": "Tests and usability checks of historical tenders with contracting authorities and economic operators."
	},	{
		"sentence": "A VCD package contains information with different validities."
	},	{
		"sentence": "It has to be defined whether a VCD package can have its own validity or if its validity is only based on the contained information."
	},	{
		"sentence": "The possibility of a definition of a minimum validity of a VCD package has to be defined Measurement Data type in Structural VCD package data which specifies validity for the whole package."
	},	{
		"sentence": "Equivalence between automated transformation and official translation of attestations."
	},	{
		"sentence": "The use of context-specific formats that include multi-lingual versions of attestations should ensure that an automated transformation from one language version into another language version delivers results that have from the viewpoint of official translations, a similar legal status."
	},	{
		"sentence": "The provision of attestations that are available in context-specific formats including multi-lingual versions and their transformation into any target language has to guarantee similar legal status and effect is reached compared to official translation."
	},	{
		"sentence": "A contracting authority sends a contract notice to a Publication body that publishes the call."
	},	{
		"sentence": "The Call for Tender should contain the definition of specific criteria on qualitative selection and exclusion that are relevant to this particular procurement."
	},	{
		"sentence": "If an economic operator decides to participate in a particular procurement procedure he can directly retrieve the relevant criteria by using the information published in the contract notice.",
		"causality": {
			"cause": "an economic operator decides to participate in a particular procurement procedure",
			"effect": "he can directly retrieve the relevant criteria by using the information published in the contract notice"
		}
	},	{
		"sentence": "In cases below threshold the economic operator might send a direct request to the procurer in order to retrieve the required information."
	},	{
		"sentence": "The economic operator will be enabled to get a mapping to the relevant national attestations via the pre-VCD mapping tool."
	},	{
		"sentence": "The contracting authority SHOULD specify a subset of evidences from the superset evidences that are relevant to a specific Call for Tender."
	},	{
		"sentence": "The scope of mutual recognition needs to be further clarified with regard to the role of candidate statements."
	},	{
		"sentence": "Not every Member State provides all attestations that are necessary for an economic operator to prove conformance with given criteria specified by another Member State."
	},	{
		"sentence": "Thus only the economic operators from Member States where such attestations are available can provide these attestations."
	},	{
		"sentence": "Other economic operators have to provide similar evidence instead."
	},	{
		"sentence": "The working group has to provide a concept of how each possible attestation has to be fulfilled (mapping of evidences defined in the directive with national implementation)."
	},	{
		"sentence": "Thereby the evidences provided by economic operator should be considered of equal value as evidences provided by a traditional issuing body if equivalence is missing.",
		"causality": {
			"cause": "equivalence is missing",
			"effect": "the evidences provided by economic operator should be considered of equal value as evidences provided by a traditional issuing body"
		}
	},	{
		"sentence": "It has to be defined which method and concept should be applied if there are missing attestations.",
		"causality": {
			"cause": "there are missing attestations",
			"effect": "It has to be defined which method and concept should be applied"
		}
	},	{
		"sentence": "Qualitative legal specification on the scope of mutual recognition."
	},	{
		"sentence": "Articles 45 to 50 of directive 2004/18/EC are the basis of our mapping strategy and for the development of the pre-VCD mapping tool."
	},	{
		"sentence": "In order to achieve good mapping results it has to be checked whether these articles are sufficiently implemented into national procurement law."
	},	{
		"sentence": "This in particular covers the semantic requirement: correspondence between national and European criteria of qualitative selection and exclusion (cf."
	},	{
		"sentence": "It has to be guaranteed whether the directive is correctly implemented in national procurement law with regard to VCD relevant articles 45-52."
	},	{
		"sentence": "In case a MS decides to exchange validation values instead of delivering an attestation physically (stage 4 specific) it must ensure that this provision is legally allowed.",
		"causality": {
			"cause": "a MS decides to exchange validation values instead of delivering an attestation physically (stage 4 specific)",
			"effect": "it must ensure that this provision is legally allowed"
		}
	},	{
		"sentence": "Directive 2004/17/EC and Article 52 of Directive 2004/18/EC may provide a legal basis for such decision."
	},	{
		"sentence": "The legal foundation in the country will provide a basis to accept these statements across borders according to the principle of mutual recognition of diplomas, certificates or other evidence of formal qualifications."
	},	{
		"sentence": "The requirement is strongly related to the organisational requirement: Scope with regard to Article 52."
	},	{
		"sentence": "The legal foundation for exchanging validation values should be given in the home Member States in order to support mutual recognition across Member States.",
		"causality": {
			"cause": "The legal foundation for exchanging validation values should be given in the home Member States",
			"effect": "support mutual recognition across Member States"
		}
	},	{
		"sentence": "Related regulations within national procurement law."
	},	{
		"sentence": "This section contains requirements concerning a European Service Provider who may host services necessary to ensure sustainable interoperability between VCD solutions in long terms."
	},	{
		"sentence": "In particular a European Service Provider refers to the pre-VCD mapping tool which will provide a basis for all other VCD application in the subsequent stages."
	},	{
		"sentence": "Especially responsibilities and services like hosting, maintaining and governing pan-European processes will be important."
	},	{
		"sentence": "Several formal legal requirements have to be answered previously in order to define the scope of such European Service Provider Requirement The legal status and legitimacy of the European Service Provider MUST be defined.",
		"causality": {
			"cause": "Several formal legal requirements have to be answered previously",
			"effect": "define the scope of such European Service Provider Requirement The legal status and legitimacy of the European Service Provider MUST be defined"
		}
	},	{
		"sentence": "Formal establishment of the European Service Provider Requirements The responsibility of the European Service Provider MUST be defined."
	},	{
		"sentence": "The liability of the European Service Provider MUST be defined."
	},	{
		"sentence": "The legal regulation applicable for the European Service Provider MUST be defined."
	},	{
		"sentence": "A suitable way to establish the relevant regulation for the European Service Provider MUST be defined."
	},	{
		"sentence": "Necessity for amendments of existing regulations has to be proofed."
	},	{
		"sentence": "This section contains requirements concerning a National Service Provider who may host services necessary to ensure sustainable interoperability of a national VCD solution in long term."
	},	{
		"sentence": "In particular a National Service Provider refers to any VCD system and VCD package that is developed within a Member State."
	},	{
		"sentence": "Especially responsibilities and services like hosting, maintaining and governing the national processes with regard to a VCD solution will be important."
	},	{
		"sentence": "Several formal legal requirements have to be answered previously in order to define the scope of such a National Service Provider.",
		"causality": {
			"cause": "Several formal legal requirements have to be answered previously",
			"effect": "define the scope of such a National Service Provider"
		}
	},	{
		"sentence": "The responsibility and the related processes of the National Service Provider MUST be defined."
	},	{
		"sentence": "The liability of the National Service Provider (depending on its legal status) MUST be defined."
	},	{
		"sentence": "The legal regulation applicable for the National Service Provider MUST be defined."
	},	{
		"sentence": "A suitable way to establish the relevant regulations for the National Service Provider MUST be defined."
	},	{
		"sentence": "Necessity for amendments of existing regulations has to be proofed."
	},	{
		"sentence": "Regulations concerning monetary aspects of the VCD service provision must be defined, therefore related legal regulations must be considered.",
		"causality": {
			"cause": "Regulations concerning monetary aspects of the VCD service provision must be defined",
			"effect": "related legal regulations must be considered"
		}
	},	{
		"sentence": "Definition of the legal basis for the establishment of such Service Provider."
	},	{
		"sentence": "In many countries there are certain regulations with regard to evidences that have to be considered."
	},	{
		"sentence": "For example in some countries it is not allowed to directly issue an extract from the register of conviction to the economic operator but to directly deliver these evidence to the requesting authority."
	},	{
		"sentence": "Special legal regulations for evidences MUST be considered."
	},	{
		"sentence": "Regulations for handling the non-existence of selected evidence requested in a MS MUST be defined and made operational."
	},	{
		"sentence": "Results of analysis of legal basis."
	},	{
		"sentence": "Data protection defines a legal basis for the handling of information relating to people or entities."
	},	{
		"sentence": "Data protection is the main piece of legislation that governs the protection of personal or entity related data in a way in which individuals or entities can enforce the control of information about themselves."
	},	{
		"sentence": "Although data protection does not directly refer to principles like data privacy, data confidentiality, data availability, non-repudiation of data, data integrity and data security these principles are strongly connected to data protection."
	},	{
		"sentence": "Thus data protection plays an important role for a VCD."
	},	{
		"sentence": "Relevant regulations of national data protection acts MUST be analysed and considered."
	},	{
		"sentence": "Additional requirements for cross-border data exchange MUST be analysed and considered."
	},	{
		"sentence": "Results of analysis of legal basis."
	},	{
		"sentence": "The VCD package is just one part of a bid that an economic operator may submit to a contracting authority."
	},	{
		"sentence": "Therefore the rules and regulations in each Member State have to be analysed with regard to the prospects of separating these two parts from each other."
	},	{
		"sentence": "This may also include for example to submit a VCD package via the PEPPOL infrastructure while submitting other parts or the bid itself via secondary channels or whether tendering platforms enable such separation."
	},	{
		"sentence": "It MUST be clarified which prospects and limitations exists within a Member State to separate a VCD package from the tender itself."
	},	{
		"sentence": "Results of analysis of legal basis."
	},	{
		"sentence": "There are several actors that are involved in the processes related to WP2 and these processes have to be defined with regard to trust between the entities involved."
	},	{
		"sentence": "Trust models have to be defined for each process in order to clarify roles and responsibilities during transactions."
	},	{
		"sentence": "This may include on a national level the definition of trust with regard to roles and responsibilities between national service providers and issuing bodies (public/private)."
	},	{
		"sentence": "On the European level it may include the scope of mutual recognition for example the trust between the national service provider who provides a VCD simple package and the European service provider who provides a particular mapping facility."
	},	{
		"sentence": "A trust model and trust system MUST be defined from a legal point of view for every process which includes the roles and responsibilities of the entities involved."
	},	{
		"sentence": "Ensuring trust through suitable legal regulations about roles, responsibilities and processes."
	},	{
		"sentence": "Some documents exchanged during the electronic procurement process have to be legally valid following EU Directives."
	},	{
		"sentence": "Directive 2004/18 states that the public procurement procedures and the rules applicable to service contests require a level of security and confidentiality higher than that required by Directives."
	},	{
		"sentence": "Accordingly, the devices for the electronic receipt of offers, requests to participate and plans and projects should comply with specific additional requirements."
	},	{
		"sentence": "To this end, use of electronic signatures, in particular advanced electronic signatures, should, as far as possible, be encouraged."
	},	{
		"sentence": "Moreover, the existence of voluntary accreditation schemes could constitute a favourable framework for enhancing the level of certification service provision for these devices."
	},	{
		"sentence": "Electronic signature, with the same legal meaning of handwritten signature, SHOULD be encouraged in cross-border scenario."
	},	{
		"sentence": "The regulations concerning the use of electronic documents, the exchange or download of electronic documents MUST be considered (especially regulations from national procurement act and directive 2004/18/EC)."
	},	{
		"sentence": "A process for document handling compliant with the relevant legal regulations MUST be defined (especially with respect to the data protection acts)."
	},	{
		"sentence": "Agreed process definition for document handling compliant with the relevant legal regulations."
	},	{
		"sentence": "This chapter shall include technical requirements that are essential for submitting a VCD via the PEPPOL infrastructures."
	},	{
		"sentence": "In particular this refers to the proposed infrastructure of WP8 and the interrelation with our work package."
	},	{
		"sentence": "The PEPPOL infrastructure of WP8 is dedicated in particular to the exchange of electronic business documents in a secure and reliable manner."
	},	{
		"sentence": "Thereby it connects to existing e-business frameworks and value added networks and is being built on existing technologies and standards that have been tested and which have proven to be reliable and secure for enterprise use."
	},	{
		"sentence": "WP2 takes a specific role within the project by concentrating on pre-awarding issues where requirements and procedures are often stricter due to principle like equal treatment, nondiscrimination, transparency, competition etc."
	},	{
		"sentence": "Although a VCD does not include the offer itself it provides several documents that are of great importance for the award of contracts and therewith critical for the success of an economic operator for example in cases of disqualification because of late delivery of a VCD."
	},	{
		"sentence": "An overall pre-condition for using the infrastructure and WP2 solutions in long term is that they are governed even after the project lifetime by maintaining and sustaining its functions."
	},	{
		"sentence": "Therefore the governing models of WP8 and WP2 should be aligned."
	},	{
		"sentence": "Authentication is an essential feature of WP2 as a Virtual Company Dossier contains several documents that contain sensitive data about an economic operator."
	},	{
		"sentence": "Hence, it has to be ensured that only those persons that have sufficient rights are able to access and retrieve these data."
	},	{
		"sentence": "Authentication of origin is also an important feature with regard to non-repudiation, for example when submitting a VCD to a contracting authority."
	},	{
		"sentence": "Authentication is a verification of evidence of identity; for individuals and companies identifiers are used to process authentication."
	},	{
		"sentence": "Such identifiers are national and in many countries specific and maintained within sectors, like tax, health, health insurance, employment, registration authorities, etc."
	},	{
		"sentence": "PEPPOL will need to design an authentication system that serves its purposes."
	},	{
		"sentence": "Hence, collaboration with WP 1 will be strengthened in the second phase of WP 2."
	},	{
		"sentence": "Time-stamping shall ensure that the submission of a VCD is adequately documented for example to verify that it has been sent or received previously to the closure of a call for tender."
	},	{
		"sentence": "In order to obtain trust, the VCD services should use certified time stamps.",
		"causality": {
			"cause": "the VCD services should use certified time stamps",
			"effect": "obtain trust"
		}
	},	{
		"sentence": "Moreover there are several actors involved in the WP2 scenarios which need to be connected to the PEPPOL infrastructure thus a sufficient allocation of identifiers, in connection with the identity an actor claims to have, has to be ensured.",
		"causality": {
			"cause": "there are several actors involved in the WP2 scenarios which need to be connected to the PEPPOL infrastructure",
			"effect": "a sufficient allocation of identifiers, in connection with the identity an actor claims to have, has to be ensured"
		}
	},	{
		"sentence": "This shall ensure that unauthorized usage of an individuals identity is avoided."
	},	{
		"sentence": "Overall we see a need for commonly monitored identity and access management in particular for all national VCD solutions and for the PEPPOL infrastructure thus both approaches should be aligned and should make use of the same mechanisms through for example single-sign-on functionality.",
		"causality": {
			"cause": "we see a need for commonly monitored identity and access management in particular for all national VCD solutions and for the PEPPOL infrastructure",
			"effect": "both approaches should be aligned and should make use of the same mechanisms through for example single-sign-on functionality"
		}
	},	{
		"sentence": "Apart from functionalities like addressability and discovery, the infrastructure should provide access points to support the actors or services to connect to the infrastructure."
	},	{
		"sentence": "The PEPPOL infrastructure will make it possible to exchange electronic business documents in a secure and reliable manner."
	},	{
		"sentence": "Thus also the VCD should be able to be submitted through the PEPPOL infrastructure."
	},	{
		"sentence": "We also assume that a VCD in stages 2 and 3 can be potentially submitted through other means but this is up to the choice of an economic operator and should not be promoted because bypassing the infrastructure is critical from the viewpoint of using validation services to ensure confidentiality of a VCD and its contained documents (WP1) and secure and reliable transport ensured through the PEPPOL infrastructure (WP8).",
		"causality": {
			"cause": "bypassing the infrastructure is critical from the viewpoint of using validation services to ensure confidentiality of a VCD and its contained documents (WP1) and secure and reliable transport ensured through the PEPPOL infrastructure (WP8)",
			"effect": "We also assume that a VCD in stages 2 and 3 can be potentially submitted through other means but this is up to the choice of an economic operator and should not be promoted"
		}
	},	{
		"sentence": "During transportation the integrity of a VCD has to be ensured when for example validating it."
	},	{
		"sentence": "Usage of the Infrastructure will require that national access points to the infrastructure (e.g. national service providers, contracting authorities) will be implemented but also direct access points that support SMEs in connecting to it."
	},	{
		"sentence": "We also see a potential need to access web services via the infrastructure that enable client-side code generation in SOAP frameworks for example for the retrieval of attestations on demand, connecting to tendering platforms or viewing the VCD on some platform at the national service provider."
	},	{
		"sentence": "The requirements listed in the subsequent section have been identified and are essential for any WP2 solution."
	},	{
		"sentence": "They are independent of a particular stage or show interrelations between them thus they are called high-level technical requirements."
	},	{
		"sentence": "The requirements have to be fulfilled or further analysed and specified with in conjunction with WP1 and WP8 in order to further draft the technical framework with regard to the VCD."
	},	{
		"sentence": "A governing model has to be defined in order to deploy the WP2 systems and tools and to maintain their states and sustainability over time."
	},	{
		"sentence": "In this respect the composition, structure and scope of the governing model has to be formally defined to ensure fulfilment of functions like liability, sustainability and maintainability (e.g. especially to maintain and sustain a pre-VCD mapping tool in long term and therewith to ensure (re-)liable functions) The dedicated governing model should have the necessary status and power to govern its assigned functions."
	},	{
		"sentence": "It MUST be clarified how the governance model of WP2 fits into the overall governance model of WP8."
	},	{
		"sentence": "The identity and access management of systems for company evidential documents is regulated by local procedures and could become part of the WP2 proposed systems (cf. stage 2 description)."
	},	{
		"sentence": "Economic operators have to apply for a VCD account in order to become authenticated."
	},	{
		"sentence": "An officer has to verify whether the data that is necessary to apply for an account belongs to the economic operator and has to assure its correctness."
	},	{
		"sentence": "An economic operator can authenticate to the VCD system only when the economic operator has sufficient user rights provided by identity and access management.",
		"causality": {
			"cause": "the economic operator has sufficient user rights provided by identity and access management",
			"effect": "An economic operator can authenticate to the VCD system"
		}
	},	{
		"sentence": "Thereby WP2 has to take into account which natural person has the power to act as authorized representative of the economic operator."
	},	{
		"sentence": "WP2 stakeholders MUST be authenticated to the VCD system and for the PEPPOL infrastructure."
	},	{
		"sentence": "Formal authentication mechanism."
	},	{
		"sentence": "The identity and access management procedures for creating a VCD account SHOULD be harmonized with the registration procedure of the overall infrastructure provided by WP 8."
	},{
		"sentence": "A single-sign-on should be implemented in order to allow identity and access management across different systems.",
		"causality": {
			"cause": "A single-sign-on should be implemented",
			"effect": "allow identity and access management across different systems"
		}
	},	{
		"sentence": "Work package 2 will use the PEPPOL infrastructure for discovering addressing information which is typically stored in a registry."
	},	{
		"sentence": "Therefore we need to find a method how addresses can be allocated and being provided to the WP 2 stakeholders so that they can use the PEPPOL infrastructure for exchanging VCDs and access related services."
	},	{
		"sentence": "A method MUST be found how to allocate identifiers to the participants that use the infrastructure for transportation of VCDs and related services."
	},	{
		"sentence": "Joined strategy and method with WP8 how to allocate identifiers among stakeholders and WP2 related services."
	},	{
		"sentence": "Member States are building electronic identity management systems as a key element in their national strategy to deploy electronic services."
	},	{
		"sentence": "Those national based systems are evolving without taking into account the requirement for interoperability that is needed in a cross-border scenario, resulting in a fragmented service that prevents the deployment of pan-European electronic services."
	},	{
		"sentence": "In the public procurement business process, as in other electronic business processes, electronic identity is a key element for two main purposes: Avoiding unauthorized use of individuals identity Assuring to administrations that individuals are the persons they claim to be and have the mandate they claim to have."
	},	{
		"sentence": "Every party participating MUST be uniquely identifiable."
	},	{
		"sentence": "As per the wide deployment of the Internet and the web, most electronic Government services have been focused on the provision of services through websites."
	},	{
		"sentence": "However, using websites is not a good approach when dealing with services that affect business processes in both ends of a collaboration."
	},	{
		"sentence": "Those business processes, such as the public procurement processes, can be run between applications, so no human intervention should be enforced to those organizations with automated procurement systems."
	},	{
		"sentence": "In such cases, every partner in the collaboration needs to be addressable so electronic documents can be exchanged from end to end through the underlying transport infrastructure."
	},	{
		"sentence": "Every party participating SHOULD have a secure and verifiable electronic address."
	},	{
		"sentence": "To exchange electronic documents between parties in a cross-border environment, a major challenge is to find out the other party's address and to understand what are his systems capabilities and requirements."
	},	{
		"sentence": "Different levels of maturity and implementation of electronic business interfaces on public administrations and economic operators across Europe obliges to create mechanisms for discovering the supported standards, documents and endpoints for trader partners."
	},{
		"sentence": "In stage 4 it MUST be possible to discover the verified electronic address for an identified party."
	},	{
		"sentence": "The VCD is just one part of bid that an economic operator may submit to a contracting authority."
	},	{
		"sentence": "Therefore the systems in each Member State have to be analysed with regard to the prospects of separating both parts from each other."
	},	{
		"sentence": "This may include for example to submit a VCD via the PEPPOL infrastructure while submitting other parts or the bid itself via secondary channels or whether tendering platforms enable such separation."
	},	{
		"sentence": "It MUST be clarified whether tendering platforms enable a separated submission of a VCD and the bid itself."
	},	{
		"sentence": "The PEPPOL infrastructure MUST have the capability to submit a VCD to a contracting authority or tendering platform."
	},	{
		"sentence": "Functionality for submitting VCD to a contracting authority or tendering platform."
	},	{
		"sentence": "The PEPPOL infrastructure SHOULD have the capability to submit a bid which contains a VCD."
	},	{
		"sentence": "Discussion with WP8 about the prospects to have a functionality for submitting a bid to a contracting authority or tendering platform that includes a VCD."
	},	{
		"sentence": "Ensuring that information is accessible only to those authorized to have access and in a predefined date is mandatory by the European Directive in some public procurement processes."
	},	{
		"sentence": "Specifically, contracting authorities must provide a way to receive electronic tenders and ensure those electronic tenders are not accessed until the prescribed time for opening them."
	},	{
		"sentence": "Annex X of the Directive 2004/18/EC lists the requirements relating to devices for the electronic receipt of tenders, requests for participation and plans and projects in contests."
	},	{
		"sentence": "It MUST be possible to guarantee confidentiality for specific documents."
	},	{
		"sentence": "WP1 assumes that all actors can sign inside their corporate infrastructure."
	},	{
		"sentence": "The e-tendering platform must offer download functionality for forms and other material to be filled in, signed, and returned by an economic operator."
	},	{
		"sentence": "A validation service may be a technical service or a Validation Authority (VA) that takes on liability and acts as a trust anchor of its own."
	},	{
		"sentence": "Validation services may be chained in order to serve requests that cannot be handled by the local validation service."
	},	{
		"sentence": "The VCD essentially relies on such validation service in order to guarantee data integrity and confidentially of a VCD."
	},	{
		"sentence": "It must be possible to apply the validation service provided by WP1 to a VCD in order to enable economic operators to guarantee data integrity and confidentiality of a VCD.",
		"causality": {
			"cause": "It must be possible to apply the validation service provided by WP1 to a VCD",
			"effect": "enable economic operators to guarantee data integrity and confidentiality of a VCD"
		}
	},	{
		"sentence": "Testing of validation service with VCD within the PEPPOL infrastructure."
	},	{
		"sentence": "It MUST be clarified whether the VCD can use the validation service of WP1 if the transportation infrastructure is not used by an economic operator."
	},	{
		"sentence": "The purpose of an e-business transport infrastructure is to transport business documents between business partners."
	},	{
		"sentence": "The transactions must be performed with high level of security and reliability."
	},	{
		"sentence": "It must be ensured that business documents are actually delivered to the recipient party."
	},	{
		"sentence": "Transport mechanisms between partys addresses MUST be reliable."
	},	{
		"sentence": "The e-business transport infrastructure is to transport business documents between business partners."
	},	{
		"sentence": "The transactions must be performed with high level of security."
	},	{
		"sentence": "It must be ensured that third parties cannot intercept and read or modify the business documents."
	},	{
		"sentence": "Transport mechanisms between partys addresses MUST be secure."
	},	{
		"sentence": "Data integrity ensures data has not been altered or modified during any operation such as transport or storage."
	},	{
		"sentence": "Integrity can be compromised both by malicious intervention from a third party or by errors in the transport or storage mechanisms."
	},	{
		"sentence": "Despite legal issues about the integrity of certain documents such as the electronic invoices, it should be a general rule to assure the integrity of all documents exchanged between partners."
	},	{
		"sentence": "It MUST be assured that business document instances are consistent and correct during transportation, validation or transformation operations."
	},	{
		"sentence": "In electronic procurement, some processes require to ensure that the sender of an electronic document cannot repudiate its validity."
	},	{
		"sentence": "Authentication of origin for business document instances MUST be supported."
	},	{
		"sentence": "In electronic procurement, some processes require to ensure that the documentation is delivered before a time limit set."
	},	{
		"sentence": "Time stamping SHOULD be applied in some processes to certify relevant date and time."
	},	{
		"sentence": "In electronic procurement it is fundamental to create a trust environment for the economic operator."
	},	{
		"sentence": "A trust environment is needed in several phases of the eProcurement process."
	},		{
		"sentence": "The electronic procurement process MUST have an audit trailing to ensure transparency for both parties."
	},	{
		"sentence": "Furthermore the Commission Service designed a questionnaire Eligibility of tenderers 21 in order to facilitate access to information related to some of the above mentioned evidences."
	},	{
		"sentence": "The questionnaire contains a set of European criteria and requirements derived from directive 2004/18/EC and connected to specific evidences in order to make them comparable among Member States."
	},	{
		"sentence": "Besides that, results from the Study on the proposal for a tool for a mutual information mechanism on the electronic provision of certificates and attestations usually required in public procurement procedures and the country profile templates developed by Siemens Time."
	},	{
		"sentence": "lex commissioned by DG MARKT have been Stage 1, the pre-VCD mapping tool, will be built upon this information by providing automated mappings and comparisons between the defined documents via the mentioned exclusion criteria (cf. Table 10)."
	},	{
		"sentence": "Combining structural information about evidence and the criteria mentioned in the Eligibility of Tenderes they are referring to, it will be firstly possible to set up a database with common definitions that referring to evidences and secondly to define precise mapping between those evidences via the templates."
	},	{
		"sentence": "Every partner of this work package should therefore fill the pre-VCD mapping tool with national instances and define the mapping to European criteria."
	},	{
		"sentence": "This will also enable VCDs of the piloting country to work on a wider scope."
	},	{
		"sentence": "Even if a country hasn't defined a pilot implementation for a VCD it can receive and interpret a VCD according to the information provided by the pre-VCD mapping tool.",
		"causality": {
			"cause": "a country hasn't defined a pilot implementation for a VCD",
			"effect": "it can receive and interpret a VCD according to the information provided by the pre-VCD mapping tool"
		}
	},	{
		"sentence": "The next section provides an overview of relevant technologies that may enable such a mapping of evidence."
	},	{
		"sentence": "Italy plans to adapt its current companys dossier builder to the design and implementation principles set by PEPPOL WP2."
	},	{
		"sentence": "This requires a set of actions in order to conform to the adopted standards and interoperability agreements of PEPPOL WP2."
	},	{
		"sentence": "The interoperability dimension represents the challenge at the moment as very few transactions take place across borders and when they are performed they represent a heavy burden for those attending their execution."
	},	{
		"sentence": "Italy is pressing on this by adopting different measures, i.e., by improving the organizational infrastructure, by offering better visibility of the involved organizations, by designing and developing policies that increase the trust among national and European organizations, by improving the information processing environment in order to reach the requirements set by the PEPPOL community."
	},	{
		"sentence": "The conformance to PEPPOL's WP2 interoperability standards will be approached by following the project agreed roadmap that includes the design and management of a dynamic knowledge base, known as the pre-VCD mapping tool and by implementing VCD services that conform to a multi-stage approach."
	},	{
		"sentence": "For PEPPOL's project runtime, Italy is planning to reach Stage 2 as ultimate stage in its system and services evolution along with solid contributions for the analysis and design of the upper level stages."
	},	{
		"sentence": "The Italian implementation approach includes a long preparation activity that focuses more on legal investigation rather than technical engineering."
	},	{
		"sentence": "Currently, the major challenge on interoperability across Europe comes from the persistent non homogeneous legal background and the reluctant attitude towards digital objects, mostly on electronic documents, digital identities and public registries."
	},	{
		"sentence": "We see the two aspects, i.e. the legal and technical closely related, and aim at treating them with equal priority."
	},	{
		"sentence": "Effort will be spent on refining and consolidating the document's acquisition infrastructure that represents a multi-site networking system to reach the different certification authorities that are the authoritative suppliers of documents essential to the VCD package construction."
	},	{
		"sentence": "A specific set of tasks will also address the transformation of evidences from the conventional form into an electronic form for computer assisted handling and management."
	},	{
		"sentence": "As part of the interoperability dimension, there will be a supporting action for digging into existing certificates and dragging out of them the most valuable information."
	},	{
		"sentence": "The piloting phase of the Italian VCD service will include the technical actions identified by the implementation plan and some interfacing events to reach selected stakeholders and define through their input the driving conditions for the VCD setup."
	},	{
		"sentence": "This interfacing activity will precede the final design and the real pilot implementation."
	},	{
		"sentence": "The VCD service provider for the piloting phase will be the Italian Business Registers System."
	},	{
		"sentence": "This section provides an overview about the deliverable and in particular about major requirements for VCD interoperability."
	},	{
		"sentence": "The requirements and contents contained in chapters 2, 3 and 4 can be aggregated according to the following aspects: Level of support: The different levels of support address the maturity of the service and the maturity of the VCD package, where the former correspond to the functionalities (e.g. compilation support vs. recompilation support) provided and the latter corresponds to the semantic richness of the provided information (e.g. information support vs. decision support)."
	},	{
		"sentence": "A VCD Package will show its full potential when all the requested attestations (all that are necessary to prove all requested criteria) are contained in it.",
		"causality": {
			"cause": "all the requested attestations (all that are necessary to prove all requested criteria) are contained in it",
			"effect": "A VCD Package will show its full potential"
		}
	},	{
		"sentence": "The VCD promotes a step wise approach in order to reach a sufficient level of completeness by concentrating first on evidences with regard to Articles 45 - 46 and afterwards on evidences with regard to Articles 47 - 50."
	},	{
		"sentence": "The paradigm shift refers to the handling of documents to handling of information and electronic exchange of information in order to establish interoperability on the basis of mutual recognition."
	},	{
		"sentence": "The VCD should encompass this change."
	},	{
		"sentence": "The criteria for qualitative selection and non-exclusion as defined in Article 45 to 50 of Directive 2004/18/EC are the common ground for building a cross border VCD service."
	},	{
		"sentence": "Evidences will be connected to these criteria by further defining and grouping them into sub criteria and atomic criteria."
	},	{
		"sentence": "Provides a widely available tool which contains the up-to-date mappings of European criteria and evidences."
	},	{
		"sentence": "The tool is build upon a basic semantic interoperability model consisting of relationships between evidences available in the Member States and European criteria of qualitative selection and exclusion (Superset)."
	},	{
		"sentence": "Tender specific requirements then have to be stated by contracting authorities according to the European criteria during notification phase in order to derive tender specific mapping results on evidences required to submit at tendering (Subset)."
	},	{
		"sentence": "Establishment of a VCD system which consist of VCD services, hosted by a VCD service provider."
	},	{
		"sentence": "VCD services are capable to collect evidences from different sources and compiling VCD packages from it."
	},	{
		"sentence": "VCD simple package defines the structure of a package with regard to types of data."
	},	{
		"sentence": "Types of data contained in a VCD: Provide the basis for a common structure of a VCD."
	},	{
		"sentence": "Includes several data types (cf. ANNEX I Glossary) to build the VCD from different sources and formats (e.g. tender specific data that refer to a particular Call for Tender, the evidences itself as electronic file or scanned copy and structural data of evidence that describe the evidences according to generic aspects)."
	},	{
		"sentence": "Introduces several additional VCD services that increase the level of support for the entities involved."
	},	{
		"sentence": "Economic operators are for example enabled to maintain their data through re-compilation of a VCD or to merge their VCD with VCDs from other economic operators in order to create groups of economic operators for bidding consortia."
	},	{
		"sentence": "VCD advanced package also introduces context specific data as additional type of data that describe the content of an attestation in a machine interpretable format."
	},	{
		"sentence": "VCD networked package: Introduces on-demand retrieval of attestations that are sufficiently described through context specific data."
	},	{
		"sentence": "The VCD networked package offers a good opportunity for a national service provider to establish official list of approved economic operators as foreseen in Article 52 (1) of Directive 2004/18/EC."
	},	{
		"sentence": "Therefore national service providers have to store attestations and referencing to it within the VCD."
	},	{
		"sentence": "Contracting authorities are mandated to request attestations in individual cases if they do not trust on the list of approved economic operators.",
		"causality": {
			"cause": "they do not trust on the list of approved economic operators",
			"effect": "Contracting authorities are mandated to request attestations in individual cases"
		}
	},	{
		"sentence": "The VCD networked package needs conflict resolution in cases of failure or system errors during on demand requests.",
		"causality": {
			"cause": "failure or system errors during on demand requests",
			"effect": "The VCD networked package needs conflict resolution"
		}
	},	{
		"sentence": "Lists the requirements forming the organisational basis for implementing any of the VCD stages."
	},	{
		"sentence": "They are independent of a particular implementation or stage thus they are called organisational requirements for a VCD.",
		"causality": {
			"cause": "They are independent of a particular implementation or stage",
			"effect": "they are called organisational requirements for a VCD"
		}
	},	{
		"sentence": "Legal Framework: Lists the requirements forming legal basis for any VCD stage."
	},	{
		"sentence": "They are independent of a particular VCD implementation or stage thus they are called legal requirements for a VCD.",
		"causality": {
			"cause": "They are independent of a particular VCD implementation or stage",
			"effect": "they are called legal requirements for a VCD"
		}
	},	{
		"sentence": "Semantic Framework: Lists the requirements which form the semantic basis for any of the VCD stages."
	},	{
		"sentence": "They are independent of a particular implementation or stage thus they are called semantic requirements for a VCD.",
		"causality": {
			"cause": "They are independent of a particular implementation or stage",
			"effect": "they are called semantic requirements for a VCD"
		}
	},	{
		"sentence": "Technical Framework: Referring to the PEPPOL infrastructure."
	},	{
		"sentence": "The technical framework lists several requirements that are essential to specify the technical (transportation and validation) basis in order to submit any WP2 solution across borders."
	},	{
		"sentence": "They are independent of a particular implementation or stage thus they are called technical requirements for a VCD.",
		"causality": {
			"cause": "They are independent of a particular implementation or stage",
			"effect": "they are called technical requirements for a VCD"
		}
	},	{
		"sentence": "In a next step these results will be transformed into a SWOT Analysis identifying the Strengths and Weaknesses of the proposed concept and its market opportunities."
	},	{
		"sentence": "The major objective of this deliverable is to develop a concept for a VCD and to define major requirements that shape this VCD concept."
	},	{
		"sentence": "Therefore we have defined different scenarios and a vision that contains several different levels of maturity."
	},	{
		"sentence": "With the staged maturity model we intend to reach a wide flexibility and openness of such a solution encompassing all Member States to implement their individual preferences."
	},	{
		"sentence": "Nevertheless the concept provides common grounds such as the pre-VCD mapping and structural data of evidences which ensures interoperability of evidences and their perception across borders."
	},	{
		"sentence": "Beside we defined a set of requirements on organisational, semantic, technical and legal level that clarify general aspect of VCD development and deployment."
	},	{
		"sentence": "To support the mutual recognition of evidences across border the VCD requires an underlying semantic model that enables a standardized classification and mapping between them (pre-VCD mapping tool)."
	},	{
		"sentence": "If the contracting authority specifies the relevant evidences which are related to criteria, the data can be processed automatically in order to look-up the evidences required within another Member State.",
		"causality": {
			"cause": "the contracting authority specifies the relevant evidences which are related to criteria",
			"effect": "the data can be processed automatically in order to look-up the evidences required within another Member State"
		}
	},	{
		"sentence": "The standard structure of the VCD, with the semantic enrichment of its structure then provides a European-wide understanding and format of company formal evidence."
	},	{
		"sentence": "The different levels of maturity can be applied in dependence on the willingness and readiness of every Member State."
	},	{
		"sentence": "The aim is to support basic interoperability and exchange of documents on the lower maturity levels and leading towards direct electronic exchange of evidence in the higher maturity levels."
	},	{
		"sentence": "Thereby each maturity level is built upon the lower ones thus allowing integration and stepwise advancement."
	},	{
		"sentence": "The VCD shall ensure that a significant part of the public procurement processes can be made through electronic cross-border transactions."
	},	{
		"sentence": "Therefore the national focus of a VCD needs to be enhanced through a cross border perspective."
	},	{
		"sentence": "The VCD will provide the possibility to utilize evidences used in one Member State and to submit them across borders to any European contracting authority."
	},	{
		"sentence": "A VCD provides a single point of contact for an economic operator that enables him to invoke and manage different services to create a VCD."
	},	{
		"sentence": "A service (re-)compiles the VCD package for the economic operator or even a group of economic operators."
	},	{
		"sentence": "The VCD services merge data from several sources into a single container and make this data available and understandable to the actors involved."
	},	{
		"sentence": "Economic operators will be enabled to perform checks with regard to the existence and validity of the requested evidences in the VCD package."
	},	{
		"sentence": "Structural data of evidence will provide guidance for foreign contracting authorities to understand the evidences contained within a VCD and they can trust that general information since it is provided by national VCD service providers that take the role of trusted parties.",
		"causality": {
			"cause": "it is provided by national VCD service providers that take the role of trusted parties",
			"effect": "Structural data of evidence will provide guidance for foreign contracting authorities to understand the evidences contained within a VCD and they can trust that general information"
		}
	},	{
		"sentence": "Context specific data will be provided on the higher levels to increase decision support."
	},	{
		"sentence": "There are also some weaknesses that can be identified for the overall concept."
	},	{
		"sentence": "These weaknesses are mostly derived from the complexity of the domain and how the VCD solution reacts on this domain."
	},	{
		"sentence": "One of the biggest weaknesses is probably the development of context specific data for the evidences within a VCD."
	},	{
		"sentence": "The development of context specific data shall ensure the automatic processing of electronic attestations without regard to linguistic barriers."
	},	{
		"sentence": "The development of standards and context specific vocabularies is time consuming and requires long term involvement of user groups that will make use of these standards."
	},	{
		"sentence": "The VCD contains several different kinds of evidences and to develop common standards for each one cannot be a major task and focus of this work package and should be done by initiative such as CEN BII, BRITE, XBRL or ECRIS."
	},	{
		"sentence": "Since CEN BII workshop is close to an end it will probably not work out to do this development within its scope.",
		"causality": {
			"cause": "CEN BII workshop is close to an end",
			"effect": "it will probably not work out to do this development within its scope"
		}
	},	{
		"sentence": "Nevertheless we will start to develop comm of contents and marginal variances in their contents."
	},	{
		"sentence": "Furthermore we rely on structural data of evidences that describe and characterize evidence from a more generic point of view."
	},	{
		"sentence": "The possibility to replace the full document translation with a selective translation through context specific data (keywords and major contents) bares certain risks."
	},	{
		"sentence": "The selective translation could be arranged in multiple languages in particular when context specific data belongs to a common agreed dictionary of expressions."
	},	{
		"sentence": "Nevertheless the acceptance of those selective translations instead of certified translations may be questionable for contracting authorities."
	},	{
		"sentence": "Thus the resolution of language barriers and linguistic issues cannot be completely managed by a VCD in short term and may require adding official translations beside selective translations."
	},	{
		"sentence": "Provision of context specific data is a precondition to establish direct information exchange between attestation providers and contracting authorities."
	},	{
		"sentence": "This direct information exchange would provide many opportunities with regard to increase the actuality of evidence, to lower the transaction costs of the parties involved and to reduce the time to create a VCD."
	},	{
		"sentence": "Nevertheless such direct exchange is very difficult to establish because a lot of entities and attestation services have to be federated, access policies have to be developed, legal uncertainties have to be resolved and political guidelines have to be considered."
	},	{
		"sentence": "To circumvent these problems the VCD provides in particular in stage 4 a guideline on how to move forward in order to reach this ambitious aim but it will not be a major focus of a VCD as such."
	},	{
		"sentence": "The VCD will be dependent on a number of services that rely on manual and semi-automated input."
	},	{
		"sentence": "Thus the VCD system will be primary a tool for the economic operator to arrange a VCD package instance which is conform according to the requirements stated in particular call for tender which he can fill through additional inputs."
	},	{
		"sentence": "A direct access to attestation via the national VCD service provider can only be provided for those public attestations that are already available in electronic format."
	},	{
		"sentence": "The VCD will not enforce any development of electronic attestation on a national level as this is a clear national duty and is depended upon the development of context specific data."
	},	{
		"sentence": "Nevertheless existing attestations may be extended through additional annotations that describe these documents generically (structural data of evidences)."
	},	{
		"sentence": "Unclear yet is the role of Member States that have already implemented Article 5224."
	},	{
		"sentence": "The scope of mutual recognition needs to be further clarified with regard to acceptance of these procedures across borders and the liability of those trusted third parties across borders."
	},	{
		"sentence": "It needs to be further defined how a VCD can support countries that have implemented Article 52 but since there are currently no pilots in our work package that have such procedures already implemented we have left this out of scope."
	},	{
		"sentence": "Neverton representations (context specific data) for evidences that have an, easy structure, low quantityheless we see a great opportunity to combine both ideas as shown in stage 4."
	},	{
		"sentence": "A major point of discussion in the domain is a sustainable and reliable long-term vision for exchanging attestations among Member States."
	},	{
		"sentence": "In the long-run the VCD should be able to adequately fulfil the contracting authorities need to proof conformance to certain criteria for qualitative selection and exclusion while reducing the burden of proof for the Economic Operator."
	},	{
		"sentence": "The costs of transaction of economic operators can be reduced through a single point of contact and through automatic arrangement of a VCD package instance according to the given criteria."
	},	{
		"sentence": "Therewith manual comparison of tender specific requirements is being omitted."
	},	{
		"sentence": "The same burden lays on contracting authorities who have to check for each evidence whether the issuer has appropriate rights within that country to provide evidence."
	},	{
		"sentence": "Furthermore the possibility to re-use evidences that are still valid (time) and the maintenance of a VCD will again provide possibilities for cost reductions at the side of the economic operator."
	},	{
		"sentence": "A paradigm shift towards electronic exchange of evidence and a next generation of attestations and certificates that are currently barely available in electronic form may be promoted by a VCD."
	},	{
		"sentence": "At least the structural representation of attestation will provide benefit for the entities involved by providing transparency about the tendering requirements and the evidences that have to be submitted in cross border procedures."
	},	{
		"sentence": "The pre-VCD mapping tool in particular will ensure transparency on cross border tendering requirements and will give indications about mutual recognition of evidences across borders."
	},	{
		"sentence": "In contrast a VCD package contains the data necessary to prove the suitability of an economic operator according to these requirements."
	},	{
		"sentence": "Therewith the VCD ease the overall procedure, may raise the number of cases of cross border procurements and may raise possibilities for greater competition across borders."
	},	{
		"sentence": "The requirements specification at hand lays the ground for further development towards a VCD."
	},	{
		"sentence": "The report lists requirements that scope a potential solution according to the different levels of maturity and generic requirements."
	},	{
		"sentence": "These requirements now have to be taken further into account in order to specify the VCD and implement the various stages."
	},	{
		"sentence": "To facilitate management of the requirements, they will be transformed into a spreadsheet with information as shown in Table 11."
	},	{
		"sentence": "A distinction will be made among functional requirements, non-functional requirements and requirements that specifically refer to the development process."
	},	{
		"sentence": "The spreadsheet will be used in the project in order to maintain, adapt and perform change management to the requirements over the project lifetime."
	},	{
		"sentence": "Maintaining them over the project lifetime will ensure that the requirements are complete, explicitly defined, clearly described, numbered and referenced."
	},	{
		"sentence": "Further characteristics to evaluate the quality of requirements will be considered such as their determinability (atomic character), verifiability (well defined measurement towards the fulfilment of a requirement), traceability (tracking of complete fulfilment as well as of where a requirement emerged from) and consistency (conflicts between requirements such as contrary features or quality aspects)."
	},	{
		"sentence": "The requirements will be the basis for further development and will provide guidance and reference to subsequent activities."
	},	{
		"sentence": "Taking the PEPPOL development infrastructure guidelines, SCRUM25 or the waterfall model (McDermind_and_Rook, 1991) as reference models, the next phase focuses now on the detailed design of the VCD concept as presented above."
	},	{
		"sentence": "This phase will further detail the requirements through explicit models and artefacts that describe relevant process flows, data characteristics and software."
	},	{
		"sentence": "Drafting agreed models requires interdisciplinary work between participants with different skills."
	},	{
		"sentence": "Software engineers thereby may design a software model for the mapping of evidences together with legal experts that ensure the legitimacy of such a model."
	},	{
		"sentence": "Furthermore we intend to work closely together CEN BII workshop and DG Markt (including Siemens and Time.lex) when drafting these models in order to ensure long term sustainability of the solution envisaged."
	},	{
		"sentence": "The shared artefacts then can provide the basis for the implementation stage."
	},	{
		"sentence": "They will also be fed back to the requirements and may enforce change to them."
	},	{
		"sentence": "The report at hand aimed at documenting the functional and non-functional requirements for a Virtual Company Dossier."
	},	{
		"sentence": "Departing from a description of the current procedure when economic operators collect the necessary evidences as proofs of selection and exclusion criteria in public tenders, the team of work package 2 has elaborated a four-stage vision for the VCD."
	},	{
		"sentence": "This four-stage concept takes into consideration different strategies and levels of development in the provision of evidences within Member States."
	},	{
		"sentence": "With the implementation of stage 1, the pre-VCD mapping, a first level of interoperability and facilitation to collect the necessary evidences for a public tender in another Member State is supported."
	},	{
		"sentence": "The VCD concept, however, fosters higher maturity degrees, i.e. interoperability and facilitation for both, economic operators and procuring agencies through machinereadable and computable VCD packages containing the individual evidences."
	},	{
		"sentence": "Throughout the analysis, elaboration and definition of the VCD concept plus the necessary research affiliated with this activity, fruitful insights could be collected about dependencies and interrelationships, which make this domain rather complex."
	},	{
		"sentence": "The project team is aware of the fact that the VCD concept conceptualised in this report is rather generous - especially if we attempt to implement stage 4 of the VCD vision."
	},	{
		"sentence": "A big step towards interoperability and cross-border facilitation in the collection of company information of economic operators can already be made when implementing the pre-VCD mapping tool."
	},	{
		"sentence": "Consequently, a recommendation is given to focus implementation on the pre-VCD mapping tool for widespread application of a VCD at first hand."
	},	{
		"sentence": "This very first level of interoperability and semantic mapping is the basis for the subsequent stages."
	},	{
		"sentence": "Nonetheless, the big potentials of interoperability, of facilitation, of cost savings and of reduction of administrative burden lay in the implementation of stages 3 and 4."
	},	{
		"sentence": "The two pilots scheduled within WP 2 will concentrate their efforts on these latter stages, and hence will evidence the potentials of these stages."
	},	{
		"sentence": "They form the test cases for a wider rollout of the VCD concept as developed throughout phase 1 of work package 2 within PEPPOL."
	}
]
