[
	{
		"sentence": "This document will give a detailed description of the Video Searching software."
	},	{
		"sentence": "The software will be used to search multiple web sites for streaming videos and torrents and return these results to the user."
	},	{
		"sentence": "This document will cover the features of the software and include specifics on what the system will do and any constraints and external factors that might affect the system."
	},	{
		"sentence": "This document is intended for the developers of the system and project managers as guide to building the software."
	},	{
		"sentence": "It will also be used by the potential users of the product to get their opinions on the software, this will help to revise and improve the product."
	},	{
		"sentence": "The Overall Description will give an overview of the product functionality and features."
	},	{
		"sentence": "Also mentioned are the constraints that will affect the system and the interface."
	},	{
		"sentence": "This section will be used by the rest of the document and will give a better understanding of the system."
	},	{
		"sentence": "The third section, the System Features, gives a full description of the actions preformed by the system and gives details on the functions that are executed."
	},	{
		"sentence": "All the major services that will be provided by the product are documented here."
	},	{
		"sentence": "The fourth section, the External Interface Requirements, will give details on the interaction between the user and the software through external interfaces."
	},	{
		"sentence": "This section will give a description on hardware and software interfaces that the Video Searching software requires to perform an action."
	},	{
		"sentence": "Other requirements of the software will be described in the fifth section, Other Nonfunctional Requirements."
	},	{
		"sentence": "This will give the requirements for the software when dealing with external entities and restrictions."
	},	{
		"sentence": "This Video Searching software will be a system that uses an active internet connection to search multiple websites for streaming videos or torrents."
	},	{
		"sentence": "The system will be used to aid the user when trying to locate a specific video or genre of video.",
		"causality": {
			"cause": "trying to locate a specific video or genre of video",
			"effect": "The system will be used to aid the user"
		}
	},	{
		"sentence": "It will help them reduce searching time through various different websites by searching all these websites with just one query."
	},	{
		"sentence": "It provides tools to help when navigating through search results which will save time and effort.",
		"causality": {
			"cause": "navigating through search results which will save time and effort",
			"effect": "It provides tools to help"
		}
	},	{
		"sentence": "The software aims to help the user by providing a simple interface and a more efficient way of finding the video they require."
	},	{
		"sentence": "It will also provide the user with various options and tools to help make their search more relevant to the content that they need."
	},	{
		"sentence": "The system will contain databases of the different websites that will be used within the search."
	},	{
		"sentence": "These databases can be easily updated to provide a wider searching range."
	},	{
		"sentence": "The program is a new self-contained product."
	},	{
		"sentence": "It has come about due to the demand for such a product being identified in a series of Ethnography studies."
	},	{
		"sentence": "From these studies we saw that the main activity people used video for was the watch content found online."
	},	{
		"sentence": "These people would regularly spend periods of time searching websites to try and find the videos they wanted to watch, either somewhere to stream the video from or the files to download the video."
	},	{
		"sentence": "This was especially true of the studies by Alan Woosnam, Irshad Qabool and Will Josephy."
	},	{
		"sentence": "Our system will aim to speed up this process."
	},	{
		"sentence": "The main feature of the system will be a search engine for finding the location of torrents and streaming sites for videos on the internet."
	},	{
		"sentence": "The user can specify which of the 2 or both to look for."
	},	{
		"sentence": "The results will be divided into the types that were specified using different tabs, and then the results will be orderable by different categories, such as name, size, site, etc."
	},	{
		"sentence": "The user will have the option to filter out videos containing certain content depending on age restrictions, for example adult content."
	},	{
		"sentence": "In addition the user will have the option to filter out or only search certain websites; for example a user may only want to look at videos on YouTube."
	},	{
		"sentence": "They will have the facility for users to store their favorite videos, so that they can come back to the video at another time.",
		"causality": {
			"cause": "They will have the facility for users to store their favorite videos",
			"effect": "they can come back to the video at another time"
		}
	},	{
		"sentence": "There will be two levels of user for our system."
	},	{
		"sentence": "The first will be the general user that will be using our software to find their videos."
	},	{
		"sentence": "They will only see the front end of the system."
	},	{
		"sentence": "The second level will be the system developers."
	},	{
		"sentence": "They will be able to edit which sites the system will search, depending on whether they think the site is safe, compatible with our software, the speed at which the site can be searched, and how useful the site is to us, i.e. how many results have come back from that site."
	},	{
		"sentence": "The system will be portable; this means it will work across different operating systems including Microsoft XP and Vista, Mac OS X and a range of Linux platforms."
	},	{
		"sentence": "Also it will work with different web browsers, for example Internet Explorer, Firefox, and Safari."
	},	{
		"sentence": "The hardware needed for our system will be a reasonably up-to-date computer that is connected to the internet via a modem."
	},	{
		"sentence": "The user will give a search-term that will search through a database of compatible torrent websites that are added by the development team."
	},	{
		"sentence": "The results of this search will be displayed as web links in a tab on the programs main window."
	},	{
		"sentence": "This is one of the main features of the software and therefore has a high priority for development."
	},	{
		"sentence": "User ticks streaming host tick box: system will now query the torrent websites in its database when a search is started.",
		"causality": {
			"cause": "a search is started",
			"effect": "User ticks streaming host tick box: system will now query the torrent websites in its database"
		}
	},	{
		"sentence": "User enters search term and starts search: system sends queries to the torrent websites in its database based on the search term."
	},	{
		"sentence": "Results for this query will then be sent to the torrent tab in the program where they will display information such as website, seeds, peers, size, date posted and a link for the webpage."
	},	{
		"sentence": "User sorts the search results by clicking once on a column header: system sorts all results by descending/ascending order."
	},	{
		"sentence": "User clicks on next page button: system displays the next set of results for the search."
	},	{
		"sentence": "Description and Priority."
	},	{
		"sentence": "User ticks streaming host tick box: system will now query the video hosting sites in its database when a search is started.",
		"causality": {
			"cause": "a search is started",
			"effect": "User ticks streaming host tick box: system will now query the video hosting sites in its database"
		}
	},	{
		"sentence": "Hosting sites will include the actual videos on their servers, e.g. YouTube."
	},	{
		"sentence": "User ticks streaming links tick box: system will now query the video link sites in its database when a search is started.",
		"causality": {
			"cause": "a search is started",
			"effect": "User ticks streaming links tick box: system will now query the video link sites in its database"
		}
	},	{
		"sentence": "The link sites will include external video links to different video hosting sites, e.g.surfthechannel.com."
	},	{
		"sentence": "User enters search term and starts search: system sends queries to the video websites in its database based on the search term."
	},	{
		"sentence": "Results for this query will then be sent to the video stream tab in the program."
	},	{
		"sentence": "The hosting half of the tab displays the website, full video name, length and date posted."
	},	{
		"sentence": "The link half of the tab displays the website and video name (e.g. combination of the show's name and the episode name)."
	},	{
		"sentence": "User sorts the search results by clicking once on the column header: system sorts all results by descending/ascending order."
	},	{
		"sentence": "User filters websites they want to be shown in the results: system removes unselected websites from the results."
	},	{
		"sentence": "User clicks on next page button: system displays the next set of results for the search."
	},	{
		"sentence": "The user Interface will consist of one main screen, allowing all the functionally to come from this one screen."
	},	{
		"sentence": "This allows the user to use the software with ease by not flicking through a number of different screens."
	},	{
		"sentence": "In addition to this the user can always see the videos they are looking for."
	},	{
		"sentence": "The main screen will be laid out as in Appendix: B Diagram along with the description of the diagram."
	},	{
		"sentence": "We decided on this type of interface because we felt that it would be very simple for the user to navigate.",
		"causality": {
			"cause": "we felt that it would be very simple for the user to navigate",
			"effect": "We decided on this type of interface"
		}
	},	{
		"sentence": "From our reports we found that the simpler the interface was, the more people liked it."
	},	{
		"sentence": "With all these features complied into one screen it will give the software more flexibility and allows for easy and simple usage."
	},	{
		"sentence": "This will appeal to both naive computer users and experienced computer users with a higher selling market."
	},	{
		"sentence": "The software will use hyperlinks to allow the user to open websites in their default web browser."
	},	{
		"sentence": "Communication standards that will be used through the software will be PHP or other such languages."
	},	{
		"sentence": "These will be used to query the different servers that the websites use and will give us back."
	},	{
		"sentence": "Our development team must thoroughly investigate each website within our database each month, to ensure that no illegal or harmful content is exposed to our users."
	},	{
		"sentence": "We don't maintain any user data or host any content."
	},	{
		"sentence": "While all safety measures resulting from the site may not be fully identified, a recommendation of a full legal review of the software should be undertaken before the site is available to the public."
	},	{
		"sentence": "In doing so, the site will be subject to full indemnification of liability."
	},	{
		"sentence": "The system we produce will stay within all the legal requirements on our behalf, as our software is only listing links for video streams and video download, and this is not illegal."
	},	{
		"sentence": "Our system will not host any videos."
	},	{
		"sentence": "In the next version we will consider adding a system to also search UseNet Binaries."
	}
]
